{"number": 20, "names": "jacquesm", "comments": [{"comment": "GPUs today already routinely have 500+ cores and are doing quite well. There are very few real problems with these visions, they're realizing themselves as we speak.<p>Of course SIMD is not the same as 1K fully independent cores but they're both valid interpretations of parallel computing.<p>That kind of architecture only lends itself to a certain class of problems but they're a good indication of what can be done to circumvent the interconnect limitations.<p>A typical GPU hides access to slow resources by doing more computations.", "link": "item?id=3474367", "user": "jacquesm"}, {"comment": "This thread and a the story make me equally sad.<p>The thread because this is one of the most hateful and ugly threads I've ever seen on HN. A thread like this would be literally unthinkable a year or more ago, and now I'm not even surprised it is here.<p>The story because it is about the death of a person that could easily be a role model for a large number of young children, but females especially in third world - and other - countries.<p>Those writing from their comfy first world lives that feel the need to point out how 'privileged' this girl was and belittle her achievements have to stop and think - excellent advice from elsewhere in this thread - before they continue to write.<p>The internet has a long memory. Being insensitive to the death of any child makes you look ugly, stupid and negative in ways that I find hard to describe.<p>Whatever your motivation, jealousy, a general misunderstanding of the station of women in many third world countries or any other thing that might have prompted you to write what you wrote here: Let me tell you straight from the heart that I think this girl was everything you in particular should aspire to be.<p>Smart, articulate, compassionate and gifted. The fact that she may or may not have been a member of a family of some standing in Pakistan does not diminish her achievements.<p>More often than not those that are born into positions of wealth or with other so called advantages squander their fortunes and end up with less than their parents left them with. That's an all too common story.<p>This girl took what little life she had and grasped it with both hands, then made the best of it. I hope that when my time comes I'll be able to say I did the same.", "link": "item?id=3468102", "user": "jacquesm"}, {"comment": "For valid reasons the build system is very minimal and the number of external dependencies is limited to 'absolutely necessary', adding another interpreter to the list of dependencies is simply not an option.<p>But sure, if that's not one of the limitations you're working under then code generation through another language is definitely a possibility.", "link": "item?id=3457199", "user": "jacquesm"}, {"comment": "I think this answers some of those questions:<p><a href=\"http://www.techdirt.com/articles/20111208/08225217010/breaking-news-feds-falsely-censor-popular-blog-over-year-deny-all-due-process-hide-all-details.shtml\" rel=\"nofollow\">http://www.techdirt.com/articles/20111208/08225217010/breaki...</a>", "link": "item?id=3456611", "user": "jacquesm"}, {"comment": "I don't particularly like include files in the middle of structs, but it looks like X macros might work.<p>Thanks for the tip, I'll have a look at them to see if there is a way around that so that it would work from a 'top' included file as well.<p>The project I'm working on has a single 'master include' file and I'd hate to break that convention.", "link": "item?id=3456349", "user": "jacquesm"}, {"comment": "Lisp does not have an attitude.", "link": "item?id=3448829", "user": "jacquesm"}, {"comment": "Technically, paypal is a bank:<p><a href=\"http://en.wikipedia.org/wiki/PayPal#Bank_status\" rel=\"nofollow\">http://en.wikipedia.org/wiki/PayPal#Bank_status</a><p>It depends on where you are, in the EU it definitely is a bank.", "link": "item?id=3422086", "user": "jacquesm"}, {"comment": "Would you consider WikiPedia a minimally viable product?", "link": "item?id=3417984", "user": "jacquesm"}, {"comment": "Define 'work'.<p>Figures from several freemium businesses that I am familiar with suggest that this model works on the 'lifestyle' end as well as on the 'more money than you could reasonably spend in a lifetime' ends of running a business, and I presume on many points in between. The trick is not to lose too much money on your free users and to make them pay in some other way, for instance by selling advertising or by engaging them to promote the product to others.", "link": "item?id=3417944", "user": "jacquesm"}, {"comment": "PCI compliance is worth as much as the party that signs off on you being compliant, in most cases that is you.<p>Audits are few and far between, lots of places have shoddy security but claim they are Fort Knox.<p>PCI compliancy is quite meaningless unless the people that implement it take their job seriously. That's very frequently not the case, it is just seen as a small obstacle in the way of doing business.", "link": "item?id=3417929", "user": "jacquesm"}, {"comment": "I've played around with some pretty bad ass magnets during the time that I was building wind turbines and one of the more interesting effects was that if you dropped one near anything made of steel you were actually in danger of getting shrapnel embedded in your body.<p>They move so fast it is scary, sometimes they explode on impact. This makes you pretty nervous about dropping them.<p>Then, one day one got dropped over a chunk of solid aluminum. It floated gently to the metal landing with a soft 'click'. Besides the initial surprise (I realized the eddy currents induced a magnet field of opposing polarity in the aluminum) what struck me most was the force of that opposing magnet. If you tried to force the magnet close to the aluminum at speed it would resist so strongly that you never managed to smash it into it with any kind of effectiveness. Always just that soft 'click'.<p>I still have a bunch of 3\"x2\"x1\" neos waiting for some project, and whenever someone visits that's interested in technology I show them what those things can do, if you have tried to pry one of those from a chunk of solid steel (or if you're unlucky, another magnet) you know what I mean when I say I have a lot of respect for those little golden blocks.", "link": "item?id=3375439", "user": "jacquesm"}, {"comment": "Rather the opposite.", "link": "item?id=3375421", "user": "jacquesm"}, {"comment": "Check on all except for the blanket, thank you for the reminder. Preparation is half the battle with anything.<p>Incidentally I found it quite hard to find a 'non-toy' first aid kit. Most companies will sell you a crappy set of contents in a very spiffy looking plastic box, that would be mostly useless in any situation beyond nicking your finger while peeling potatoes.", "link": "item?id=3372692", "user": "jacquesm"}, {"comment": "They do and they don't. Yes, it is true that MRI machines weigh 5 tons because of the magnetic fields generated and the amount of hardware required to constrain those fields.<p>But you could imagine an MRI machine that works with lower strength fields and better sensor technology. Imagining one is a far cry from being able to build one though and I don't see this happening in the near future (if at all).<p>I think this prediction (like most of IBM's predictions about the future) is strong on marketing and very weak on science.", "link": "item?id=3372672", "user": "jacquesm"}, {"comment": "At the risk that hairbrained is another one of your plays on words, there may be a typo in there ;)", "link": "item?id=3371682", "user": "jacquesm"}, {"comment": "Likely google thought they would make up the expense in increased adsense revenues from the publishers that use Apture post shut-down, but 12 hours is a terribly short window for a shut-down to be effective.<p>I wonder how often they'll be able to buy the 'next Apture' until they figure out that they're going to have to live with it, after all if it only takes 12 hours to clone then this seems like a winning business model with a guaranteed exit.", "link": "item?id=3371459", "user": "jacquesm"}, {"comment": "The media emphasizes younger co-founders because it makes for a much better story. Rags to riches before you're 25 sounds so much better than the same before you're 60.", "link": "item?id=3367651", "user": "jacquesm"}, {"comment": "Scribd is a Y combinator company.", "link": "item?id=3367437", "user": "jacquesm"}, {"comment": "<a href=\"http://news.ycombinator.com/item?id=973997\" rel=\"nofollow\">http://news.ycombinator.com/item?id=973997</a>", "link": "item?id=3367434", "user": "jacquesm"}, {"comment": "The easiest to understand analogy to illustrate this that I've found to date is to imagine a tube full of marbles, push one more marble in on one end and another one will pop out <i>instantly</i> on the other end. As long as the marbles are all the same colour it is as though the marble you pushed in has miraculously teleported to the far end of the tube. It appeared to have moved at the speed of light even though in reality all the marbles have shifted only an amount equal to the diameter of a single marble.", "link": "item?id=3366450", "user": "jacquesm"}], "children": [{"number": 13, "names": "bitops", "comments": [{"comment": "&#62; <i>The thread because this is one of the most hateful and ugly threads I've ever seen on HN. A thread like this would be literally unthinkable a year or more ago, and now I'm not even surprised it is here.</i><p>I agree with you on this point a thousand times. What is going on with this community? In general I like HN, but there's a real trend brewing when it comes to gender-related articles. And it's not pretty.<p>HN regularly churns out some of the most biased, vitriolic and short-sighted commentary when it comes to women that I've ever seen in any online community.<p>Question is, what can we do to counteract it?<p>[EDIT: as expected, I'm being downvoted. Good riddance, HN.]", "link": "item?id=3469264", "user": "bitops"}, {"comment": "True, a dual card GPU system can have 1000 cores today, however the cores provide primarily computation on a small (or procedurally generated) data set. This makes them great for simulating atomic explosions, CFD, and bit coin mining but for systems which read data, do a computation on it, and then write new results they don't have the I/O channels to support that sort of flow effectively. Back when I was programming GPUs one issue was that channel bandwidth between the CPU's memory and the video card was insufficient so that textures had to be maximally compressed or procedurally generated or you would starve TPUs waiting for their next bit of Texel data. I'm not sure if that is still the case with 16x PCIe slots however.", "link": "item?id=3476674", "user": "ChuckMcM"}, {"comment": "But the Lisp community does.", "link": "item?id=3456103", "user": "bborud"}, {"comment": "Not that being a bank means much in the EU, see the situation in quite a few member states.", "link": "item?id=3423000", "user": "bowyakka"}, {"comment": "I don't understand the question.", "link": "item?id=3418114", "user": "tptacek"}, {"comment": "Thanks. Odd that VISA would let the third party auditors get away with it, until they don't... which I'd hope so in this case.<p>Related: <a href=\"http://serverfault.com/questions/293217/our-security-auditor-is-an-idiot-how-do-i-give-him-the-information-he-wants\" rel=\"nofollow\">http://serverfault.com/questions/293217/our-security-auditor...</a>", "link": "item?id=3418115", "user": "teyc"}, {"comment": "Video of a large magnet being dropped onto aluminum: <a href=\"http://www.youtube.com/watch?v=iABmUEH5s0k\" rel=\"nofollow\">http://www.youtube.com/watch?v=iABmUEH5s0k</a>", "link": "item?id=3376291", "user": "burgerbrain"}, {"comment": "Yeah, I've never found a pre-assembled first aid kit which is worthwhile -- much better to assemble your own, so you know exactly where everything is and how to use it.  I used to keep an IFAK on me and also a larger buttpack-style medical kit to put under a pack.<p>I'm kind of sad that I lost one of my good Italian army blankets at the vehicle accident the other night -- I didn't want it back after it was covered in a random person's blood and glass, and she was still using it.  Annoyingly most of the good surplus sources for heavy wool blankets have gone dry.<p>I keep a minor-injuries kit for definitive care for minor comfort things (some small bandaids, OTC medications, wet wipes, etc.) separate from an actual trauma kit (well, one in cabin and a bigger one in the trunk) (4-8 israeli dressings, 2 Combat Application Tourniquets, some rolls of gauze, sterile blades, catheter/needle for tension pneumothorax, cpr mask (which I'd only really use on sketchy random people who appear ill, otherwise IMO its a waste of time, although in a bigger kit a BVM would be great), some needles, some nitrile gloves, surgical tape, duct tape, 2 SAM splints, hot and cold packs).  Add to that the other normal zombie/earthquake/etc. things (heavy trash bags, crowbar, and trauma-causing implements), and I am really happy to have a car vs. take public transit.<p>Also, a case or two of water and sports drink (gatorade) is really useful in the car.  If nothing else, blankets and a $3 case of bottled water saves a lot of money on road trips and at gas stations.", "link": "item?id=3372788", "user": "rdl"}, {"comment": "At first I thought it was an eggcorn (look it up), but it turns out that both hairbrained and harebrained have long histories, so if it is an eggcorn, it is an old one.", "link": "item?id=3371714", "user": "einhverfr"}, {"comment": "I think they didn't so much shut it down because they wanted it to die--they probably shut it down because they didn't want to support it and moved the team over to working on the Chrome feature alluded to in the article.", "link": "item?id=3371818", "user": "tikhonj"}, {"comment": "I think there's also a disproportionate media focus on the <i>really</i> big successes, which do seem to have had pretty young founders: Apple (21 &#38; 25), Microsoft (19), Google (24 &#38; 25), Dell (19), Amazon (30), etc.", "link": "item?id=3367921", "user": "_delirium"}, {"comment": "Yep. That's presumably why pdf links on here have that [scribd] link next to them.", "link": "item?id=3367936", "user": "JonnieCache"}, {"comment": "There is a problem with that analogy: if you only apply pressure to a single marble, the marble at the other end will <i>not</i> be pushed out instantly. In fact, the 'signal' will travel with the speed of sound in the material of the marbles and you can measure the time difference it takes for the last marble to move after the first one has moved. The marbles will be slightly compressed and decompressed while moving, accounting for the extra length needed to accommodate the 'not moving instantly'. [1]<p>A better analogy would be one where all marbles are pushed simultaneously. That is more like what happens in logic circuits.<p>[1] People doubting relativity often try this thought experiment: I have an incompressible metal bar of a lightyear long. I press on one side. The other side must move instantaneously and not after 1 second (or longer). In fact, this proves the reverse: relativity is incompatible with the existence of incompressible metal bars. As we know, all metal bars are in fact compressible, so that is not a problem. And with compressible metal bars, the thought experiment fails, because the push will travel with the speed of sound.", "link": "item?id=3366465", "user": "Confusion"}], "children": [{"number": 6, "names": "jacquesm", "comments": [{"comment": "It is mostly to cover their behinds not really to protect your data. When it comes to litigation they basically want to point to a piece of paper with your signature on it and say \"see they agreed to be compliant\" it is not our fault, we did all we could.", "link": "item?id=3418261", "user": "rdtsc"}, {"comment": "&#62;HN regularly churns out some of the most biased, vitriolic and short-sighted commentary when it comes to women that I've ever seen in any online community.<p>I really don't see that at all.  There might be some implied sexism, and perhaps occasionally overt sexism, but it's nothing like what you see on other parts of the Internet.  I've seldom read a top-rated comment on HN and thought, \"wow, that's really sexist.\"  Sure, they exist at the bottom of the page, but there isn't much we can do about that.<p>Do you have a discussion in mind that makes you feel that way?  I'd like to see an example of what you consider \"biased, vitriolic, and short-sighted commentary when it comes to women.\"", "link": "item?id=3469819", "user": "redthrowaway"}, {"comment": "I wonder if anything happened to the guy's watch?  It looks like a movement piece rather than digital.", "link": "item?id=3377798", "user": "dhimes"}, {"comment": "Well, we aren't using my grandmother's computer programming language much (Fortran)....  Thank goodness ;-) hahahahah", "link": "item?id=3368414", "user": "einhverfr"}, {"comment": "It would be nice if HN could at least add a link to the raw PDF.<p>I wonder if PG even uses scribd himself?<p>For me the builtin PDF-Viewer in chrome works perfectly fine whereas scribd is a terrible experience.", "link": "item?id=3368335", "user": "moe"}, {"comment": "That's true, but it is only an analogy, and like every other analogy it breaks down at some level (after all, it isn't the 'real thing').<p>The fact that there is a pressure wave set up in the materials is possible because marbles are made of some material (glass, stone, metal, whatever). If you wanted a 'perfect' picture you'd have to explain about electron migration in detail and then we're looking at a completely different picture.<p>You'd not have a pressure wave in an electron to begin with, and they're not 'pushing' against adjacent electrons either.<p>But it serves well to show how a slow move can have an apparent instantaneous effect at a distance.", "link": "item?id=3366515", "user": "jacquesm"}], "children": [{"number": 5, "names": "teyc", "comments": [{"comment": "I saw an Australian company offering tokenising solutions for credit card transactions. Glancing briefly, they talked about replacing credit card number with \"tokens\" that can be stored on the customer's premises, while the actual card numbers are securely stored on theirs. To me it seems to be a sensible approach to reducing the attack surface or auditable surface. Is this what Stripe does?", "link": "item?id=3418651", "user": "teyc"}, {"comment": "I think you can wear a steel watch around a strong magnet, there will be little magnetic filed penetrating the outer body. AFAIK, gold watches are not recommended.", "link": "item?id=3378045", "user": "Jun8"}, {"comment": "Actually, Fortran is pretty widely used in the sciences.  If you're working with R, you're probably doing some Fortran stuff, too.", "link": "item?id=3370245", "user": "dgabriel"}, {"comment": "Actually in this case it was the Scribd URL that was submitted. If a URL pointing to a PDF had been submitted, then the title text would link to the raw PDF and the appended '[scribd]' text would link to the Scribd version of it.", "link": "item?id=3368705", "user": "chaosprophet"}, {"comment": "<i>[Electrons are] not 'pushing' against adjacent electrons</i><p>Sure they are.  Like charges repel.<p>Charge density in this case plays the same role as mass density does in the case of a sound wave.  It's a very good analogy.", "link": "item?id=3366902", "user": "ScottBurson"}], "children": [{"number": 2, "names": "rdtsc", "comments": [{"comment": "I had no idea the magnetic screening was so effective.", "link": "item?id=3378168", "user": "dhimes"}, {"comment": "Visa has the \"visa verify\" and it is a web service that basically asks extra security questions during authorization. That works online only. Relies on the merchant to provide the extra security.<p>Another thing is temporary one-use credit card numbers. My Discover card as that feature. Of course then it also relies on me to assess the risk of a merchant and go through the steps of getting that number.", "link": "item?id=3419489", "user": "rdtsc"}], "children": null}]}]}, {"number": 2, "names": "bermanoid", "comments": [{"comment": "Edit: I had a thing written here, but I figure I'm not understanding what you mean by 'all marbles are pushed simultaneously'. Can you elaborate? Other than the conflation of the speeds of light and sound (which is not such a  big deal, really), it's a good analogy.", "link": "item?id=3366748", "user": "bluedanieru"}, {"comment": "<i>In general I like HN, but there's a real trend brewing when it comes to gender-related articles. And it's not pretty.</i><p>I didn't notice any gender-related comments on this article (I'm late to the party, so maybe I missed some that were higher up earlier), but HN does tend to be a place where people tend to post statements of disagreement far more often than they agree with whatever is posted. I'm certainly guilty of this myself on many (most?) occasions.<p>To some extent this is good and fosters a spirit of healthy debate, but in this case, it's out of place. This is an extremely sad event, and we don't need to be picking apart this girl's achievements while we should be mourning her passing, whatever her gender may be. Whether or not a Microsoft certification is a fantastic achievement at whatever age, this girl represents all the qualities that we should be encouraging in young people everywhere, and it's horrifying to see people try to diminish that.<p>It's always a tragedy when a 16 year old dies; it's even more upsetting when they were on such a promising trajectory. We should be sad about this without reservation, not questioning whether her path was provably remarkable enough to be worth talking about.", "link": "item?id=3469883", "user": "bermanoid"}], "children": [{"number": 1, "names": "Confusion", "comments": [{"comment": "As for the 'all marbles are pushed simultaneously': a key characteristic of useful transistors is that they operate as amplifiers[1]. This is possible because effectively, every transistor has its own power source. As such, on each clock cycle, then can all get a simultaneous push from their power sources.<p>[1] <a href=\"http://en.wikipedia.org/wiki/Transistor#Simplified_operation\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Transistor#Simplified_operation</a><p>BTW, I'm not conflating the speeds of light and sound. If you bang on one side of an iron bar, a wave travels through the material, quickly compressing and decompressing the bar where the wave passes. Such waves travel at the speed of sound in that material, no at the speed of light. That makes sense, because sound is nothing more than the physical modulation of the density of a medium, most commonly air.", "link": "item?id=3366846", "user": "Confusion"}], "children": [{"number": 1, "names": "bluedanieru", "comments": [{"comment": "<i>You're</i> not, the person you're replying to was. I find it odd that you would object to an analogy where the signal propagates through the marbles at the speed of light (i.e. 'instantly'), and offer up instead one where each marble moves <i>simultaneously</i>. If the exit event is simultaneous to the entry of the other marble, they are separated by a spacelike interval despite the causal relationship between the two events. This violates relativity.<p>On the other hand, in the original analogy the two events are separated by a lightlike interval, which while impossible in the case of marbles, at least does not violate relativity when the two events are causally linked. This is what I meant when I said the conflation of the speed of sound and the speed of light is not such a big deal, in this case.", "link": "item?id=3373546", "user": "bluedanieru"}], "children": null}]}, {"number": 1, "names": "Confusion", "comments": [{"comment": "The electrons are only moving at ~ mm/s. With an AC current, the net effect is that they're not moving at all. Electrical <i>power</i> is not provided by the movement of electrons. The force carriers of the electrical field, the particles responsible for actually exchanging energy, are photons.<p>I initially was mostly interested in the word <i>instantly</i>, but if we're going to analyze this analogy further, I'd have to say you just can't treat electrons inside bulk materials as particles. It may sound sensible and give you the idea you understand what's going on, but it's just not even wrong.", "link": "item?id=3366872", "user": "Confusion"}], "children": [{"number": 1, "names": "Retric", "comments": [{"comment": "Umm, yea just like the marbles in the example.  If you have a marble pushed into a pipe with 1,000 marbles the one popped out at the end is pushed out a lot faster than any single marble moves.", "link": "item?id=3367760", "user": "Retric"}], "children": [{"number": 1, "names": "maaku", "comments": [{"comment": "Ummm... no? It'll come out at roughly the same speed (less if the moment it came out there was still energy trapped in the form of compressed marbles when it emerges). Why would it be otherwise?", "link": "item?id=3369082", "user": "maaku"}], "children": [{"number": 1, "names": "Retric", "comments": [{"comment": "Have you ever seen those desktop toy's where steel balls 10+ steel balls are strung up next to each other.  You drop one and it fall hit's one end of the chain and in less time than it would have taken the first ball to move that distance the last one pops off the end?  Same concept the final ball moves a little slower than the first ball that hit the chain, but it start moving sooner than it would have taken the first ball to move the distance of the chain.", "link": "item?id=3369404", "user": "Retric"}], "children": [{"number": 1, "names": "maaku", "comments": [{"comment": "Ok that's true, but not how I read your post. Yes the energy is transfered at the speed of sound in the material, but I read your post as saying the velocity of the marble on the end is greater than the velocity of any other marble, including the one you push in, which is certainly not true.", "link": "item?id=3371754", "user": "maaku"}], "children": null}, {"number": 1, "names": "waqf", "comments": [{"comment": "It's called <a href=\"https://en.wikipedia.org/wiki/Newton%27s_cradle\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Newton%27s_cradle</a>.", "link": "item?id=3383763", "user": "waqf"}], "children": null}]}]}]}]}]}, {"number": 1, "names": "bentlegen", "comments": [{"comment": "Hyperbole.", "link": "item?id=3469338", "user": "bentlegen"}], "children": null}]}, {"number": 3, "names": "artursapek", "comments": [{"comment": "There's a story floating around my school of a student a few years ago who wanted to make a sort of hovercraft by fixing in position two opposing large supermagnets (I go to an art school). He couldn't build it when his supermagnets arrived in the mail because it was deemed too dangerous, supposedly they could have snapped or crushed someone's arm/leg easily had they come undone, and that was assuming he even survived the construction himself.", "link": "item?id=3375591", "user": "artursapek"}, {"comment": "Thanks for the moderation efforts. You've saved me a lot of misery by convincing me to read no further.", "link": "item?id=3469326", "user": "mechanical_fish"}, {"comment": "Perhaps there is an IPR issue here too? C&#38;D just around the corner?", "link": "item?id=3373649", "user": "pbhjpbhj"}], "children": [{"number": 1, "names": "jacquesm", "comments": [{"comment": "Let me give you one example of just how dangerous these things are from my own experience.<p>I was assembling the rotor/stator assembly of my windmill, to be safe I'd bolted the stator to the welding table and was lowering the the rotor around it using a chainfall.<p>Suddenly and to my complete surprise the welding table <i>leapt up</i> to the rotor just to hang there suspended by the magnetic field.<p>The table surface was a 3/8\" thick 8x4 sheet with a fairly sturdy steel frame under it. You'd be hard pressed to move it, let alone lift it.<p>Fortunately I didn't have any fingers in the airgap or I would probably be typing this a whole lot slower.", "link": "item?id=3375611", "user": "jacquesm"}], "children": [{"number": 1, "names": "po", "comments": [{"comment": "See also: The gallery of flying objects sent in by people who work with MRI machines:<p><a href=\"http://www.simplyphysics.com/flying_objects.html\" rel=\"nofollow\">http://www.simplyphysics.com/flying_objects.html</a><p>I worked with an NMR machine in college and would always have to empty my pockets before entering the room. I'm not sure I really understood the danger. I heard stories about people having piercings ripped out though.", "link": "item?id=3375946", "user": "po"}], "children": [{"number": 1, "names": "jarek", "comments": [{"comment": "A child was killed in 2001 when an oxygen tank got pulled into an MRI machine he was in: <a href=\"http://www.nytimes.com/2001/07/31/nyregion/boy-6-dies-of-skull-injury-during-mri.html\" rel=\"nofollow\">http://www.nytimes.com/2001/07/31/nyregion/boy-6-dies-of-sku...</a><p>Some system or another was running low on oxygen, someone panicked and grabbed a tank carelessly, next thing you know a tank is free where it shouldn't be.", "link": "item?id=3376230", "user": "jarek"}], "children": null}, {"number": 1, "names": "yread", "comments": [{"comment": "I've heard of a technician getting killed by flying keys of somebody else when standing next to a NMR machine", "link": "item?id=3376790", "user": "yread"}], "children": null}, {"number": 1, "names": "dedward", "comments": [{"comment": "And those, i think, are just from the fixed magnets (which may be a type of superconducmting electromagnet thats just normally on.). During a scan, dont mangetic fields go way way up?  The fixed ones are just there for stability and whatnot.", "link": "item?id=3380484", "user": "dedward"}], "children": [{"number": 1, "names": "po", "comments": [{"comment": "They are superconducting magnets kept that way through cryogenic helium. They can lose their magnetism through a process called quenching. If you search on youtube for \"MRI quench\" there are several videos of people messing around with MRI's before they get decommissioned. Not exactly safe.<p><a href=\"http://www.youtube.com/watch?v=5z33ZcDgavY\" rel=\"nofollow\">http://www.youtube.com/watch?v=5z33ZcDgavY</a><p><a href=\"http://www.youtube.com/watch?v=6BBx8BwLhqg\" rel=\"nofollow\">http://www.youtube.com/watch?v=6BBx8BwLhqg</a><p>There is a lot of helium in there and it <i>can</i> explode:<p><a href=\"http://www.youtube.com/watch?v=1R7KsfosV-o\" rel=\"nofollow\">http://www.youtube.com/watch?v=1R7KsfosV-o</a>", "link": "item?id=3380719", "user": "po"}], "children": null}]}]}, {"number": 1, "names": "artursapek", "comments": [{"comment": "Wow, I have experience welding and am trying to imagine this happening to the table I used. Sounds like that could have been a lot worse.<p>I don't really know much about this sort of thing short of seeing a huge generator on a field trip to a dam in sixth grade. The stator spins around the rotor which contains magnets, and these magnets have to be constant, permanent ones. Is that correct? I assume it's not viable to use electromagnets for this purpose since they use electricity. I bet it would be nice to be able to turn them off.", "link": "item?id=3375698", "user": "artursapek"}], "children": [{"number": 1, "names": "jacquesm", "comments": [{"comment": "Yes, they're permanent magnets.<p>The reason why you don't use electromagnets on a windmill this size is that the additional complexity isn't worth it. Though it would make assembly and dis-assembly a lot easier / safer ;)<p>It definitely could have been a lot worse, I recall having a tea break after it happened, once I stopped shaking enough to hold a glass without spilling.<p>Here is a picture of what the thing looked like in that stage of the final assembly:<p><a href=\"http://pics.ww.com/v/jacques/renewables/windmill/dscf0312.jpg.html\" rel=\"nofollow\">http://pics.ww.com/v/jacques/renewables/windmill/dscf0312.jp...</a>", "link": "item?id=3375741", "user": "jacquesm"}], "children": [{"number": 1, "names": "duck", "comments": [{"comment": "And is this the table? <a href=\"http://pics.ww.com/v/jacques/renewables/windmill/dscf0220.jpg.html\" rel=\"nofollow\">http://pics.ww.com/v/jacques/renewables/windmill/dscf0220.jp...</a>", "link": "item?id=3375999", "user": "duck"}], "children": [{"number": 1, "names": "jacquesm", "comments": [{"comment": "Hehe, yes. And on the table is my Texan friend Ron B. who is pretending someone stabbed him with a very large chisel.<p>Ron is a God when it comes to woodworking and helped out with the making of the blades when I got stuck, he traveled all the way from Texas to Northern Ontario for that. Amazing guy, really.", "link": "item?id=3376627", "user": "jacquesm"}], "children": null}]}]}, {"number": 1, "names": "billswift", "comments": [{"comment": "Actually large generators normally do use electromagnets today.  They need an external source of power when starting, but drain off a very small part of the generated power to keep running.  As jacques wrote, that isn't done with small generators because the added complexity usually isn't worth it.", "link": "item?id=3375971", "user": "billswift"}], "children": null}]}, {"number": 1, "names": "mahyarm", "comments": [{"comment": "Did you take a picture?", "link": "item?id=3375738", "user": "mahyarm"}], "children": [{"number": 1, "names": "jacquesm", "comments": [{"comment": "I took plenty of pictures (see link above and other pics in that album) but not of that particular mishap, it was decidedly unsafe to leave it all hanging suspended like that so we lowered the table/windmill combo to the ground using the chainfall.<p>I'd hate to have had the whole thing give and land on someone's foot.<p>The rotor was only press-fit into two bearings, no point in trying to find out if it would hold or not, it was meant to be pushed on, not pulled on by a welding table.", "link": "item?id=3375764", "user": "jacquesm"}], "children": null}]}]}, {"number": 1, "names": "dedward", "comments": [{"comment": "Musthave been big.   Theyd have to be anchored somehow though..... There is no stable equilibrium for ferromagnetic materials.", "link": "item?id=3380492", "user": "dedward"}], "children": null}]}, {"number": 2, "names": "kzkg", "comments": [{"comment": "Found my old password and logged in just to upvote this comment.<p>Any child driven enough to do all this at a young age would have accomplished much more down the road.<p>This is one of those negative sum situations where we all loose.", "link": "item?id=3468897", "user": "habitatforus"}, {"comment": "I once played with aluminum bottle inside a 3T MRI. It was weird - you could rotate it, but the faster you did it, the harder it was.", "link": "item?id=3376625", "user": "kzkg"}], "children": [{"number": 2, "names": "lostlogin", "comments": [{"comment": "Pretty much did the same thing myself (stopped feeling good about commenting on anything).  Her drive and humble demeanor were evident from the interviews she gave.  Her death is a loss.", "link": "item?id=3469428", "user": "protomyth"}, {"comment": "I believe it's related to this. Try leaning into the bore fast then pulling your head out, fast. Many people lose their balance temporarily. Something to do with inducing currents in the fluid in the inner ear I believe. A smaller version of the effect causes the sensation that you are moving when you lie still in the bore.<p>Edit: can't get the link easily as am on iPad, but google \"MRI eddy currents\" and watch a slab of aluminium fall", "link": "item?id=3376699", "user": "lostlogin"}], "children": [{"number": 1, "names": "chacham15", "comments": [{"comment": "Death in general is a loss. I know that this view is a bit simple-minded, but I believe that everyone has a part to play in the world and it is unfortunate that her part stops here. On the positive side, I hope that her life inspired others so that she may live on in them.", "link": "item?id=3469936", "user": "chacham15"}], "children": null}]}]}, {"number": 1, "names": "harichinnan", "comments": [{"comment": "I feel really sorry for her parents. However your sympathy stems from ignorance of the Indian sub-continent. Middle class kids in India, and I assume Pakistan have the opposite problem of what you say. They are pressured into achieving academic success come what may. The Indian IITs select .5% of the applicants. Delhi university sometimes rejects applicants getting 98% in school because there are many who get even more. Many of them go through multiple \"coaching/tuition\" classes in addition to going to school. Celebrating someone for obtaining an MCP certificate in addition to grueling coursework actually has a negative effect on already over-burdened kids.", "link": "item?id=3469574", "user": "harichinnan"}], "children": [{"number": 1, "names": "suhastech", "comments": [{"comment": "I definitely agree.<p>I always get yelled at by my parents because I do a lot of computer programming instead of studying.<p>There's minimal encouragement in this society and I've seen parents pushing kids to get into CS because it pays. Environment has lot to do in making a \"genius\". And maybe that's why we have crappy programmers here, in India, and the deviants are pulled into the stereotype.<p>Assuming Pakistan is similar to India, this girl programming at such a young age is definitely a great deal. I don't think people in the first world nations understand this.", "link": "item?id=3470308", "user": "suhastech"}], "children": null}]}, {"number": 1, "names": "rbanffy", "comments": [{"comment": "Geeks, and I am guilty of that myself, often miss the greater point and discuss endlessly increasingly narrow aspects of much larger issues. It's within our nature to do it.<p>But that doesn't mean we can't understand this drive to discuss the details, fight our little demons, and raise our heads to look at the forest instead of the trees.<p>This girl, in her short life, accomplished more than many of us ever will. Her loss at this age is tragic, but even more tragic is the loss of what she would have become. We need more people like her.", "link": "item?id=3470232", "user": "rbanffy"}], "children": null}, {"number": 1, "names": "larve", "comments": [{"comment": "HN is a community, so this site is mostly about communication between humans, and empathy is an important part of that. People telling that it is not a big deal, and that the story is hyped, are I think jealous of not having been featured in the same way. It's the media, so things usually get a bit distorted. But then we have stories about panda bears dying that make headlines as well.<p>Even if you were a nine year old girl in Pakistan having written something that people here would recognize as valuable, something like writing a url parsing module in node.js, would you post a comment questioning her achievements? Think back when you were nine, wouldn't you have loved to hear about her? I remember that when I was nine and starting programming, I had heard a terrible hard time grasping simple BASIC programs. I went on to become a fairly capable developer, and event got my share of overblown headlines at 16. Nothing bugs me about a girl getting the same, and being so incredibly much wiser and inspirational than I was. Writing a calculator in C# at 9, studying for an exam that adults take, and then being incredibly intelligent and sensible about it is a big achievement.<p>There are all these threads about CS education, codeacademy, etc... on here. Well that is what they are all about.<p>What bothers me even more is people going all free speech when someone is questioning their post. Seriously? In their place, I would start questioning what compelled me to write such a post, and why this story caught my interest so much as to write a comment saying that earning an MCP is not worth mentioning.", "link": "item?id=3469684", "user": "larve"}], "children": null}]}