{"number": 59, "names": "patio11", "comments": [{"comment": "Props to Microsoft, but this is actually pretty routine.  (It was literally written policy at a previous employer of mine.)<p>Manual exception handling at the warehouse is <i>crazily</i> expensive.  It is much, much easier to write it off (as shrinkage, not charity) than to get the item back into active inventory (all the fun of chasing invoices, except the amount payable is \"one XBox\", and the person doing the chasing sees their general productivity go to pot), particularly as it may have been opened.  The charity suggestion removes many customer objections and ends the ongoing CS expense almost immediately.", "link": "item?id=3434547", "user": "patio11"}, {"comment": "<i>The \"dangerous precedent\" you're talking about was set by the Google web spam team a long time ago.</i><p>Yep.  If you wanted to look at one particular event, several years ago a major Nazi site ranked #1 for [Jew], because the people who care about [Jew] and were early adopters on the Internet happened to be Nazis.  Google, at the time, refused to hand-edit that, and instead put PSA AdWords ads against the SERP for [Jew] saying \"While we're certainly not Nazis, the algorithm decrees that the most relevant result for this search is, regrettably, a Nazi site.\"  [Edit to add: Wow, the page did not linkrot: <a href=\"http://www.google.com/explanation.html\" rel=\"nofollow\">http://www.google.com/explanation.html</a> ]This was a deeply controversial result internally and externally at the time.<p>Google 2012 <i>is not</i> Google 2002.  Results which would get mentioned on the nightly news get fixed, period.", "link": "item?id=3426767", "user": "patio11"}, {"comment": "Somehow I think people will be able to find Chrome.<p><a href=\"http://images1.bingocardcreator.com/blog-images/hn/chrome-on-google.png\" rel=\"nofollow\">http://images1.bingocardcreator.com/blog-images/hn/chrome-on...</a>", "link": "item?id=3422608", "user": "patio11"}, {"comment": "I'm torn between \"That's almost <i>cute</i>\" and \"This is wrist-slapping ourselves to give the appearance that we administer our guidelines in a manner which is not arbitrary and capricious.\"", "link": "item?id=3422487", "user": "patio11"}, {"comment": "Oh, quick sidenote: you'll find that people are arbitrarily consistent around particular price points.  $720 is a bit weird for a day rate, so just bump it to $800, since you'll have exactly the same resistance to $800 as you would to $720.  Oh, BTW, you'll have exactly the same resistance to $1,000 as you will to $800.  (Not much, incidentally, from good clients.)<p>There, you just more than doubled your income and <i>your customers will not perceive you as being more expensive</i>.  (I know I know I know <i>trust me on this</i>.  If they were mental math experts then they would be programmers and you would have money.)", "link": "item?id=3421327", "user": "patio11"}, {"comment": "A possible way to structure that business relationship is you have identifiable projects where Real Work gets done.  You do the whole contract / invoice / etc song and dance for those, at project rates.<p><i>In between</i> projects, you make it known that you are a friendly guy, and bending your ear for a few minutes is free.  N.b. This is how lawyers will generally work.  This is to maintain customer loyalty for the five figure engagements.  Plus, since you're doing it out of the goodness of your heart, you have an instant, built-in non-excuse for unavailability.", "link": "item?id=3421253", "user": "patio11"}, {"comment": "You're only competing with offshore talent if you use similar price points, customer acquisition methods, and target customers as offshore firms.  I wouldn't suggest that - anybody for whom the solution set includes \"Or we could get this done cheaply abroad\" is likely to be a terrible customer.  (They'll undervalue your contribution, <i>because they think that houses the expensive option</i>, and they'll disproportionately be clueless about managing software development because if they were clueful they'd run screaming.)", "link": "item?id=3420769", "user": "patio11"}, {"comment": "<i>Google is paying people to generate junk content</i><p>It seems silly to me to get mad at Google for paying, what, ten thousand dollars in affiliate payouts, incentivizing cruddy posts, when they simultaneously collect (and pay out) billions for the ubiquitous AdSense ads which you find on sites which, charitably, span a wide range in terms of content quality.", "link": "item?id=3418527", "user": "patio11"}, {"comment": "Uber dynamic pricing is positive for customers on New Year's Eve, in that it ensures that if you are willing to pay money a cab is available for your use.  The market, it's magic.", "link": "item?id=3414483", "user": "patio11"}, {"comment": "I know a gentleman who swears by oDesk, mostly as a billing/mediation platform for custom Twilio apps.  I wouldn't touch it with a ten foot pole, but he charges enough to make it viable.", "link": "item?id=3396905", "user": "patio11"}, {"comment": "If you're really interested in your career rather than collecting merit badges for technology stacks, the best answer that I can give yours take your existing skills and market them better to the kind of people who result in career-enhancing opportunities for you.  To quickly sketch it out, you want to be on highly visible projects for well-connected folks/firms which have a fairly tight connection to actual money.  This has an astoundingly better ROI than learning Ruby from the perspective of increasing your market value.<p>Don't care about money and want some more opportunities for fun stuff?  Pick up enough Ruby/Rails (or Python/Django) to implement your own backends.  This lets you deliver whole projects (for yourself or others) without needing assistance.", "link": "item?id=3527664", "user": "patio11"}, {"comment": "You do iOS dev?  You need to <i>radically</i> raise prices.  If you do not, people will assume lack of competency, because your project rate would be undercharging as a day rate right now.", "link": "item?id=3527611", "user": "patio11"}, {"comment": "The industry has trained people for a decade that primary calls to action look like buttons.  People scan for this as a learned behavior, because scanning accomplishes their goals faster (true for most HNers), they don't enjoy reading, they can't read well, or they've learned by painful experience that words on a computer screen are likely scary gibberish like \"screen resolution\" and \"defragment\" and you should just click the blue thing in the bottom left corner followed by the blue E so you can get to your Googles.", "link": "item?id=3527315", "user": "patio11"}, {"comment": "Fair warning: a similar system nearly caused me to destroy my cellphone, the screen over my window, and the windshield of the Honda beneath it.", "link": "item?id=3520086", "user": "patio11"}, {"comment": "<i>Getting VP-level role at top companies is very hard and if a developer of an acquired company could score a VP-level role elsewhere after the acquisition, he could probably do so before the acquisition</i><p>The scenario is not \"I was engineer #3 at a startup which was just acquired by Google.  I'll take a corner office at Facebook now, please.\"  It is \"I was engineer #3 at a startup which was just acquired by Google.  Hello, Mr. VC.  Sure, I'll join that company you just funded as VP of Engineering.\"<p>This second one, ahem, does not strike me as supremely implausible.", "link": "item?id=3519613", "user": "patio11"}, {"comment": "<i>I bet pretty much everyone would have a correct mental model of assignment if the problem was stated like that.</i><p>Try this experiment with five people at a public place, say exactly what you said, and give them exactly one try at the correct answer.  I'll give $10 to charity for each one that getes it right.  If all five of them get it wrong, you owe me an upvote.<p>(Fair warning, the terms of this bet are ridiculously unfair to you.)", "link": "item?id=3519544", "user": "patio11"}, {"comment": "Even among startups, web scale data requirements are the exception, not the rule.  Facebook and Google are ginormous.  There are many, many very impressive applications whose database wouldn't tax a single commodity server.  (Similarly, there are applications that make terrible businesses but which consume computing resources like losing a byte of information would doom humanity.)<p>I mean, go through a list of YC companies or other startups you respect, winnow it down to the ones that exited or otherwise achieved some level of success, and play guess-the-size.  How many terabytes of storage do you think e.g. Airbnb needs?", "link": "item?id=3518636", "user": "patio11"}, {"comment": "Even a very strict libertarian should agree to the obvious harm here: the compensation package with Google that the employee negotiated in good faith has a covenant which was not disclosed to them and is materially against their interests, namely, that signing on the dotted line forecloses future avenues which you might want to pursue.  Not only were employees unaware of that, they would have active reasons to believe it would be impossible, because the laws under which that contract was negotiated say in big bold letters that provisions like that are repugnant to the state's sense of justice and will be voided even if spelled out.<p>There's a credible case for allowing people to sign away future opportunities in return for compensation in the present day, even if their counterparty has excessive leverage in that negotiation.  I don't believe it, but I wouldn't think less of you if you do.  There's no credible case for the moral righteousness of secret conspiracy against one's own employees' interests which acts to implement a term that you cannot ask for and expressly deny having sought.<p>It's structurally similar to abuse of overtime.  I happen to think you should be allowed to trade more than 40 hours a week in return of an amount of money you find motivational, if that floats your boat.  In some jurisdictions, that is illegal.  Even if you disagree with that policy, if you're negotiating a contract in those jurisdictions, you're going to assume as part of your offer that you're only agreeing to 40 hours a week for the same reason you assume that negotiating a contract will not secretly obligate you to give them your kidney.  If they then stick you with more than 40 hours a week, that's an abuse, even if you don't agree with the law: if you had been aware of the work routinely requiring more than 40 hours, you would have priced that in, but instead you priced it on the assumption of 40 hours in the mistaken belief that that was an externally imposed maximum.", "link": "item?id=3517574", "user": "patio11"}, {"comment": "Better than any equity grant or cafeteria, this shows how these companies think of their employees.", "link": "item?id=3517384", "user": "patio11"}, {"comment": "Some people are good at talking about coding (or pen testing, or sysadmining, or architecture, or...) but when you put them in front of a blank black screen with a cursor they're incapable of making forward progress.<p>It's five figures cheaper to ask everyone to FizzBuzz than it is to fire someone even after a week, and God help you if they're in a protected class.", "link": "item?id=3513940", "user": "patio11"}, {"comment": "Wow, we <i>really</i> think alike.  I posted the same thing and then saw this.", "link": "item?id=3499259", "user": "patio11"}, {"comment": "Without implying any bad will about the author of this post, who is a recruiter, recruiters are incentivized to close deals, not to get you the best possible package.  It is possible that this background would convince a recruiter that advice which is against your interests is still a good idea, because if he adopts advice which will predictably results in employees underpricing themselves, his conversion rate from interviews to paychecks will improve, possibly dramatically.  If his placements are routinely leaving $10k on the table, that only costs him $3k per placement, which might on a subconscious level either a) not be motivational or b) might be a totally rational decision because of the increased volume of placements he gets by advising people to take any reasonable deal.<p>My father is a real estate agent, and real estate agents have demonstrable blind spots (seriously, academic literature exists on this) for negotiation when negotiating for clients versus when selling their own homes.  When they're selling their own home, five hours of extra work might add $5,000 to the sales price, so of course they go the extra mile.  When they're selling a client's home, five hours of extra work might add $5,000 to the sales price <i>but their commission check only goes up by $300</i>, so they'll generally opt to tell you \"That's a really fair offer.  You should take it.  Can we close this today?  I have a young couple who I'd really like to meet with now about buying a brownstone, and the expected value of my time with them is way higher than the marginal value of my time with you.  Oh whoops did I just say that out loud?\"", "link": "item?id=3499252", "user": "patio11"}, {"comment": "<i>willing to risk losing the job</i><p>In almost all cases, the original offer is still on the table.  \"Negotiating with the decisionmaker will cost me this offer, so don't negotiate\" is something which is only really believed by engineers who are -- and I say this with love -- abominably incompetent at negotiation.  This is regrettable, since skill at negotiation matters a whole heck of a lot more than skill with Chef or mastery of Postgres trivia for determining both the instant results of the negotiation and one's larger career trajectory.<p>Still working on that blog post on negotiation, should be up early Monday for more elaboration on this.", "link": "item?id=3498971", "user": "patio11"}, {"comment": "This seems to be a misreading.  My read is \"If you sell the output of this, you grant us exclusivity.  If you breach exclusivity, we have a variety of options in dealing with you, including refusing to carry your work on our platform.  <i>In the event we do this</i> we don't owe you anything even if you think it sure would have been a swell thing if we had distributed through our platform and are inclined to sue us over the imputed lost revenue.\"<p>Exclusivity is still a very cruddy contractual term for authors, if viewed against the universe of \"all possible contractual arrangements\", but it is far from uncommon in the publishing world.  I mean, everyone is pretty much in the business of exclusive distribution towards channels they control.  If you sign with a dead-tree publisher, they're going to want exclusive rights to be your only dead-tree publisher in a geographic, cultural, or linguistic territory, even if you could get someone else to kill trees on your behalf and double your sales that way.<p>You'd have to weigh access to the Apple megaphone versus the sales you could be making through other platforms/channels.  If I were (hypothetically) going to get into ebook publishing, I'd take note that Amazon is <i>much</i> more generous (off the top of my head standard Kindle publishing requires no exclusivity and one of their programs wants just a 90 day exclusivity window for e-publishing).  This would allow you to simultaneously sell through e.g. your own site to a pre-existing fanbase and avoid the 30% (or whatever) rake, or do things like \"Hiya I'm the author of five novels and counting in this sci-fi universe I created.  The first one is $0.99 on Amazon or totally free if you sign up for my email list.\"", "link": "item?id=3496224", "user": "patio11"}, {"comment": "Allowing non-employees on company transportation would threaten to make furnishing the transportation to employees a taxable event.  See the same link that I posted on a sibling comment about food, just search for \"transportation\".", "link": "item?id=3495946", "user": "patio11"}, {"comment": "I am not Google's tax accountant, but the meals are not compensation based on the IRS' published guidelines.<p><a href=\"http://www.irs.gov/publications/p15b/ar02.html#en_US_2011_publink1000193705\" rel=\"nofollow\">http://www.irs.gov/publications/p15b/ar02.html#en_US_2011_pu...</a><p>Tax tip going way back to Learned Hand: you don't have to feel guilty about structuring your affairs to take advantage of every legitimate opportunity to decrease your tax burden.<p>Here's a related example: US tax law allows you to deduct 50% of meals incurred on business trips.  I travel internationally for a significant portion of every year, on business trips.  There are two ways to calculate how much you spend on meals: 1)  Actual cost 2) An approximation method which takes a per-diem rate supplied by the US government based on your location and adds one or two wrinkles not relevant here.  Either is acceptable to the IRS.  I keep appropriate records of business expenses, so running both the exact cost and the approximation method was trivial.  The approximation overstates my actual cost on meals by several thousand dollars -- using it as the basis for my deduction saves me about a thousand bucks.  That's <i>totally kosher</i>.<p>P.S. You know those beating-the-system-is-worth-bonus-points neuroreceptors that most of us hackers have?  Doing taxes gives you the opportunity for that sort of thing in spades.  (Though I'd probably still suggest getting someone competent to do yours -- advice which I will be taking for myself from next year on.)", "link": "item?id=3495919", "user": "patio11"}, {"comment": "I'm writing a post on salary negotiation today, so I zeroed in on two supporting details here that you should remember for later: when pressed on price, savvy negotiators said:<p>1)  Give us some time to think about it.<p>2)  We are going to re-focus the discussion on a different compensation lever where we can present something you're already going to get as if it were a new incentive justifying your concession on a lever you're currently interested in.<p><i>You can do both of these as a job seeker.</i><p>(For example, if you have extra-curricular interests like many desirable tech employees do, the extra-curricular interests can be used to justify an increase in your compensation vis-a-vis a hypothetical employee who punches out of the Internet at 5 pm.  It doesn't particularly matter that you're going to continue blogging and OSS regardless of the outcome of this negotiation, you just frame the discussion such that that becomes newly discovered value which gives the other party something to hang their hat on for getting you that last $10,000.)", "link": "item?id=3495835", "user": "patio11"}, {"comment": "Primarily Facebook (they're FB's #1 advertiser IIRC), but they also had big-budget offline promotions with the likes of 7Eleven, where you could (bastardizing the heck out of this) buy a bag of branded chips and get a free thing of special potato seeds in-game.", "link": "item?id=3495061", "user": "patio11"}, {"comment": "<i>A video game's shelf life doesn't usually last for more than 12 months</i><p>This compares rather favorably to the video game industry, where exponential sales decay sets in after 1 to 3 <i>weeks</i> for almost all titles, including ones which cost more to produce than every Zynga game produced to date combined.<p>I don't love Zynga, but their model has a lot to recommend it over \"Lets make another big-budget war movie/game with $10 million of programming, $80 million of art assets, and $120 million of launch marketing and then try to get it in front of every 18 ~ 30 year old male in America.\"", "link": "item?id=3495017", "user": "patio11"}, {"comment": "Is it cheating to suggest not knowing nothing about problem domains likely to be of interest to you, and or learning generalizable techniques for learning quickly?<p>For example, hypothetically, if one has a weakness regarding chasing down money and one knows their career path is likely to involve raising money, then one could get a fairly rapid education in the subject for the price of a few cups of strategically ordered coffee.  Don't know the character of a VC?  Thirty seconds of Googleage should give you the names of five compulsively chatty people willing to give you their take.<p>I can sort of see why, if one were busy, one would quickly burn out on explaining How To Email People A Question to folks who did not immediately see that in the solution set when they had a plan of action which required a bit of discoverable organic knowledge.", "link": "item?id=3486464", "user": "patio11"}, {"comment": "Title 18 U.S.C Section 1030 (the Computer Fraud and Abuse Act) makes it a federal offense to exceed your authorized access on, basically, any computer system anywhere.  (Does it communicate?  It is used in interstate commerce?  BAM.)", "link": "item?id=3511028", "user": "patio11"}, {"comment": "One option: Word of your skill travels at approximately the speed of beer.  (i.e. Try traditional networking.)<p>You can also have a web presence about the work which does not actually include the work.  Talk about an interesting sub-problem which is non-proprietary.  Talk about architecture choices.  Talk about the tech you used and the problems you overcame while using it.  Write about how firms in the financial industry are missing opportunities to throw Java at problems and make heaps of money.", "link": "item?id=3506103", "user": "patio11"}, {"comment": "You have quite a bit of latitude in how high ceremony your expense tracking needs to be, though.  \"CC hotel / travel expenses to our standard address, put everything on the company card\" is likely adequate, as long as there's a contemporaneous record of business travel.  Many places keep that as a formal log book, but since the IRS is pretty much ambivalent about the exact form of your records as long as they capture the important stuff, a Google Calendar entry with \"Bob speaking at $FOO_CONF in Boston 3/14\" probably suffices.  In the event of an audit, you'll be asked to provide supporting documentation (again, wide latitude) of a small sampling of those expenses, because they have no more desire to read five thousand pages of records than you do to write them.  If you're unable to provide those records, but don't strike the examiner as actively malicious, they'll say \"Alright, there's two ways I can do this.  My book says we think you have about $X of legit deductions for this category, which is $Y less than you're claiming.  Pay $Y plus our below market interest rate for making an honest mistake.  Otherwise, you and I get to do things line by line, and I'm going to suddenly get <i>very</i> picky.  Which would you prefer?\"<p>There's also a certain element of \"In the vanishingly unlikely event the IRS audited us, disallowed <i>every</i> expense our employees charged in the year, and then charged taxes on those plus the standard penalty interest, that wouldn't cost us enough for us to even notice it.\"", "link": "item?id=3504929", "user": "patio11"}, {"comment": "That is not quite how contracting math works out, though.  You have to charge <i>significantly</i> more to account for just the direct costs of your employment (such as payroll tax, half of which is salary that every employee has but is unaware of) and the benefits package.  Basically, you get to pay your own fully loaded costs.  $74 an hour at 40 hour weeks gets you a package similar to that enjoyed by an salaried engineer at $80k to $90k or so.<p>You also tend to charge more than even that calculation suggests, because you're responsible for downtime, overhead in getting new gigs between clients, credit risk, yadda yadda.  The upshot is that you'd probably have a contracting rate in the low three figures.  (They do, of course, go up from there.)", "link": "item?id=3503829", "user": "patio11"}, {"comment": "Vis-a-vis your institution, get good at grant writing.  You don't make money in academia by doing research, you make money by doing grant proposals.<p>Vis-a-vis the funding agencies, they generally have a set of concerns which are non-monetary, too, so meet them where they are.", "link": "item?id=3502389", "user": "patio11"}, {"comment": "I am very curious as to the source of your understanding for how high end consultants and speakers operate, because it very much does not match either my experience or the experiences related to me by people who I find credible.<p>For example, negotiating airfare and hotels doesn't happen.  (This was not obvious to me when I started.  Thanks Thomas.)  You just say \"We'll invoice you for them according to your standard travel reimbursement procedures.\" and that is the entire discussion.  Rates are more fluid, particularly for first-time clients.  There are different ways to manipulate one's rate, and there are other ways to manipulate total price of the engagement with add-ons such as scheduling flexibility as a line item.<p>You're correct that great consultants will not have any conversation about the difference between $59 and $64.", "link": "item?id=3502192", "user": "patio11"}, {"comment": "It is not too difficult to dodge questions about current/past salary.  We're clear on why you want to do that, right?  If you say \"My salary at my current job is $65,000\", you will receive a job offer at $70,000 +/- $2,000 regardless of whether the company would happily pay $90k for you if they had not known your current salary.<p>Anyhow, given that, there are numerous options to decline to damage your own negotiating position.  My personal favorite is \"As a matter of professional courtesy, I decline to comment on the specific policies of past employers.  Don't worry, I will treat your confidences with the same level of professionalism when someone asks me about them in a few years.\"<p>It is unfalsifiable (as opposed to what people sometimes suggest on HN: \"That is under NDA\", which is a claim that can actually be a lie), conveys status, and (gently) informs the person you're speaking with that you're aware how the game is played.", "link": "item?id=3501957", "user": "patio11"}, {"comment": "Sales guys very rarely tie their stomachs in knots with \"So I suppose technically I might have talked to five million in new accounts last quarter, but most of them required new features, so I'm not sure I can justifiably claim credit for that one without splitting it with the engineering team.\"  One might start learning from that example.  Did you lead development on a new product with $5 million in sales?  Then I might describe that as leading development on a new product with $5 million in sales.  I wouldn't recommend optimizing SQL queries on a screen no one actually uses, but if that is your day to day activity, you were improving performance of the company's flagship product which launched to over $5 million in sales.  If you're optimizing page load speed then presumably you tracked the before and after and, if you don't have great data about how that trickled into the business results, you can at least say \"I shaved 5 seconds off our dashboard.  Research from Google / Amazon / Microsoft / etc has found that page load speed has the following quantifiable impacts and that the sensitivity is on the order of 100 ms, or roughly one fiftieth of the improvement I delivered.\"<p>You can also either a) engineer your transfer to the part of the company which makes money or b) engineer your work duties such that they include things which will help career growth.  For example, A/B testing both prints money and gives very relevant, justified metrics which are likely to include things motivational to decisionmakers at current and future employers.  If you are an engineer in a company which doesn't A/B test but could, you should make that sale internally, and then nominate yourself as the obvious person to implement it.", "link": "item?id=3501734", "user": "patio11"}, {"comment": "Get attached to the part of the company that makes money, set up the measuring and politics such that you get credit for increases in the amount of money they're making, pitch a raise for you as the easiest way for them to get a repeat performance in the next quarter.  Also, since companies have persistent exploitable inefficiencies about this issue, be prepared to talk to the people who are actually willing to give you a raise. (i.e. it may not be the people you currently work for.)", "link": "item?id=3501547", "user": "patio11"}, {"comment": "This would be a very penetratingly insightful criticism if you had never heard of Airbnb, Dropbox, Twilio, etc etc.  Some people at the current classes of YC and 500 Startups may well find themselves working for AmaGooBookSoft in 4 years, and may that be a happy outcome for all concerned, but you've got to torture the math to come to the conclusion that hiring acquisitions are where most of the money is changing hands.<p>That said, it totally makes sense for AmaGooBookSoft to pay at least some engineers amounts of money which historically were not awarded to technical employees.  This should be priced into everyone's expectations, startup-affiliated or no.", "link": "item?id=3546798", "user": "patio11"}, {"comment": "<i>would require a business visa.</i><p>Just to be precise here: it probably requires an <i>employment</i> visa, which is in a different category than business visas.  You can come to the US and talk contracts with a company your company wants to do business with: that's (probably) B-1 (business).  If you're doing work in the US, you need a work-capable visa.  Some options would be TN-1 (\"Hello Mr. Canadian professional\"), L-1 (intracompany transferee), and J-1 (specialist).<p>I have some accidental knowledge about this because I used to help finangle things for Japanese folks affiliated with an employer of mine, but if you have any doubt about this sort of stuff, <i>get a lawyer</i>.  The very fact of having a lawyer makes it less likely you will get tripped up because they know how the game is played and they will provide consequential bits of advice like \"Give anyone asking questions the minimum information required and refer them to the stack of official documents you will carry with you.\"  (Bureaucracies are state machines: you give them the minimum information necessary to get the state transition you desire.)  They will also to be able to give advice such as \"Given your circumstances, one way we could hypothetically do things is X but the on-the-ground reality would be exactly the same as if we classified it as Y and Y is orders-of-magnitude easier to pass scrutiny for.\"", "link": "item?id=3546462", "user": "patio11"}, {"comment": "I have a certain amount of sympathy given that Japanese immigration features in all of my nightmares.<p>That said, attempting to cross borders for the purpose of working illegally (sorry, I don't like the law either, but there is no conceivable way that YC does not count as employment) will not endear you to law enforcement.  I wish they had been more polite in the course of discovering your true purpose and refusing you entry, but if they hadn't, that would have been a crazy result under US immigration law.<p>There's better ways to handle one's business and legal affairs tactically, but start with knowing that the US really doesn't have a visa category \"People from countries we like, for any purposes whatsoever, no questions.\"", "link": "item?id=3546189", "user": "patio11"}, {"comment": "$30 for the fabric, $30 for the store's overhead, $65 for the story that you can feel a part of every time it is on your skin.<p>Did you know my shirt was made in America and came in an Eco-friendly laundry bag?  Oh don't worry darling, the Chinese peasant did a perfectly adequate job on stitching yours.", "link": "item?id=3546054", "user": "patio11"}, {"comment": "We will now see the same racial discrimination departments which filed court briefs saying that race-neutral admissions policies would make them into Asian enclaves suddenly pretend to be shocked, shocked that anyone would suggest they were anything but valiant upholders of equal opportunity.<p>I'll refrain from opining on what the government will do, solely out of respects for the HN politics rule.<p>[Edit: One may think I am being unfair.  Here, try reading Harvard's amici brief.  <a href=\"http://www.vpcomm.umich.edu/admissions/legal/gra_amicus-ussc/um/Harvard-both.pdf\" rel=\"nofollow\">http://www.vpcomm.umich.edu/admissions/legal/gra_amicus-ussc...</a> ]", "link": "item?id=3544295", "user": "patio11"}, {"comment": "The mechanics of A/B testing math make implementing this a much less attractive proposition than you'd think it would be.  I'm going to get handwavy but it will suffice for the moment: the amount of traffic you need to get statistical significance between N options grows at like O(N^2).  How much of the color-space do you want to automatically converge over?<p>Most of my clients would struggle getting results at sufficient velocity with 10-way multivariate testing to say nothing of zomg-way multivariate testing.<p>Totally separate problem: Button color is far from the most salient thing you could be testing.", "link": "item?id=3539259", "user": "patio11"}, {"comment": "PG wrote something similar once (<a href=\"http://ycombinator.com/ideas.html\" rel=\"nofollow\">http://ycombinator.com/ideas.html</a>) and it strikes me as accurate.  The social context of sharing kind of overwhelms the technical difficulty of implementing it, so it becomes less a \"where are we going to put the bits\" problem and more of a \"who is sharing what with whom and how\" people problem.  It's never been a huge thing to me, but as I grow older I've come to learn that a lot of people close to me really, seriously care about the life stories of their families as documented by photos, and they're (still) not really well-served by the existing techy-friendly options.  (And that is a subtly different use case than <i>other</i> photo sharing needs <i>those same people</i> have, to say nothing of what other people have.)", "link": "item?id=3538385", "user": "patio11"}, {"comment": "I'd start picking a different challenge mechanic than \"Beat the average\" since the average is sensitive to distribution bring dominated by poor Redditors and incentivizing \"Pay us $5.50\" does not result in hugely more successful outcomes.  How about hiding the average and offering the bonus to anyone paying $25+?  Or even $10+?", "link": "item?id=3537096", "user": "patio11"}, {"comment": "A minor heresy: If you're doing it right, there won't be a coding challenge at the job interview.  For that matter, there probably won't be a job interview, at least not in any recognizable sense of the term.<p>I mean, the author is entirely right: skilled devs can write  their own ticket in this market.  So, um, let's start doing that.<p>I also continue to think that \"I have code on Github\" is believed to be a career enhancer not because this is actually true but because it is something that is convenient to engineers to practice.  In real life, the people whose decisions matter a) often can't read code and b) almost always have better uses of their time than reading code from someone who is, statistically, not likely to be hired.", "link": "item?id=3534645", "user": "patio11"}, {"comment": "This is not a way forward.<p>1). Work with better clients.  You can have invoice collection problems at $50k, too, but they're much less likely than at $500 and you have <i>much</i> better options for... escalation methods at that point.<p>2). If you're not a bank, stop taking on so much credit risk.  Businesses can deal with substantially sterner payment terms than you'd think to offer.  If your clients balk, see #1.  (Thomas has some suggestions here, too, many of which reduce to \"Work for Thomas' clients and charge enough that dealing with their purchasing processes is worth your headaches rather than chasing deadbeats for Snickers money.\")<p>3). Showing up on iamachumpconsultant.com will not enhance your professional reputation, bill rate, or client pool.", "link": "item?id=3533660", "user": "patio11"}, {"comment": "If you had grown up with a Kindle, and someone gave you a book for Christmas, you'd say they were certifiably insane.<p>Look at the features: a) It smells better b) You can store them and it only takes an entire room of your house c) They weigh enough such that you can curve your children's distressingly straight spines with them.", "link": "item?id=3485629", "user": "patio11"}, {"comment": "Find a class of client which either pays invoices promptly or at least pays enough to cover credit risk.  Also, charge more.", "link": "item?id=3484130", "user": "patio11"}, {"comment": "There is some intersection as of late, largely in the form of \"Why hack and deface a WordPress install with your script kiddie tags when you could instead deface several hundred thousand WordPress installs with pharma links, thereby getting tens or hundreds of thousands of dollars in affiliate commissions.  It's like robbing a bank except you won't get shot and the FBI can't bring itself to care that you did it.\"", "link": "item?id=3481967", "user": "patio11"}, {"comment": "I tried this with BCC.  It ended up being a <i>colossal</i> support expense to have guest accounts available as an option, and didn't lead to meaningful revenue.  (Literally less than $100 in about 6 months.)  I had every possible variation of \"I used it at home and now I am using it at school and the evil computer lost all of my work!!1  FIX IT NOW!\", despite telling people multiple times that exactly that would happen if they didn't put in an email address.<p>It is entirely possible that my implementation sucked or my customers are just uniquely ... inexperienced with dealing with novel usage paradigms, but test the heck out of this.", "link": "item?id=3476960", "user": "patio11"}, {"comment": "I don't know about \"torturous chaos\", but there is certainly a point early in the life of any business where a) any silver linings are accompanied by big voluminous clouds and b) many well-meaning people tell you to cut your losses (+) and take the job at Google instead.  I've gone through that three times.<p>+ : n.b. They'll say this even if you have no losses.<p>It's also probably true that, for probably any value of X less than maybe 5 years, there is a business who had a graph substantially identical to mine for day 1 through X and then decided on X to throw in the towel.", "link": "item?id=3476791", "user": "patio11"}, {"comment": "FWIW, since people don't seem to know this: Dead tree letters &#62;&#62; phone &#62; fax &#62;&#62;&#62; email &#62;&#62;&#62;&#62;&#62;&#62;&#62; any online petition, in terms of how motivated staff are to convey your sentiment up the totem pole.  (Anecdotal from brothers' service with a few congressional reps.)<p>[Edit: Sorry, checked on my screen but didn't realize my resolution was too high to show me if it broke lines.]", "link": "item?id=3474059", "user": "patio11"}, {"comment": "Two married schoolteachers in a wealthy suburban school district near their peak earning years will gross nearly $200k for the household.  (I'm related to multiple examples.)<p>The BLS collects copious stats on how much different occupations are paid.  Reports of them being working poor are highly exaggerated.", "link": "item?id=3467622", "user": "patio11"}, {"comment": "\"Reasoning\" is being a little generous: I happened to develop a setup which is a duct-taped mishmash of VPSes and external services, and every few months I pay for it with a phone call at 3 AM in the morning (local time) that says something has broken.<p>These days I'm attempting to move things off of my VPSes where there are good, stable options which don't require huge engineering efforts to use.  SendGrid for email was an early, obvious choice.  I'll be migrating many of my blogs to WPEngine fairly soon.  (I'll write up my rationale for that at length after it happens.  They're a client, so take my arguments with a grain of salt, but it became <i>painfully</i> obvious when working with them that it was the right call.)<p>If I got a do-over on my two main software products I would probably re-write them to use Heroku over self-hosting them on my VPS.  It would have avoided ~6 minor service disruptions and ~2 catastrophes in the last year, plus saved me about two weeks of lost billable time.  (Mostly lost due to having a very involved migration from Slicehost to Rackspace which went fairly poorly, principally due to failing to invest another few weeks preparing thoroughly for it.)<p>I can't justify a rewrite of BCC or AR at the moment to migrate to Heroku, though, as they're both multiple weeks of work with high probability of breaking something, and my anticipated costs due to I'm Not Always A Sysadmin But When I Am I Only Fail On The Hard Stuff this year don't quite justify it.  (Please, please, nobody buy Rackspace to shut it down.  One migration was enough.)", "link": "item?id=3466347", "user": "patio11"}, {"comment": "If you haven't heard me say it enough, note that bit about \"Given the choice between buying X units one at a time or 2X units all at once for a modest discount, people will often buy 2X units and fail to use them all.\"  That is <i>very important</i> to keep in mind when designing e.g. the packaging options of a SaaS business.", "link": "item?id=3465312", "user": "patio11"}, {"comment": "Kinda a cross between arbitrage and outright windfall, but it is a fun story:<p>Does anyone remember Battletech?  Due to a catastrophic error in a logistics system somewhere, a bookstore in Ogaki City once received a shipment of English Battletech CCG cards.  Battletech is originally an off-brand knock-off of a Japanese series, the license was never very popular in Japan, this particular product had recently died due to lack of demand in the US, and geeky English products are not hot sellers in semi-rural Japanese agricultural/manufacturing communities.  So the bookstore tried to liquidate their stock, and put the sign \"100 yen\" (then about $0.80) on the box.  Battletech packs of cards retailed for about $3 each prior to going out of print.  Score, right?<p>On investigation, the unopened box was not a box of $3 booster packs.  It was a package of $10 starter packs.  And they were first edition.  And the store, not having been able to move even their Japanese CCG cards, was <i>not interested in opening the retail box</i> so they were selling <i>all the packs in the box meant to be opened by the retailer</i> for 100 yen.<p>I told the cashier that this was likely a pricing error.  He either didn't understand what I was saying or just didn't care.  So I bought a few boxes of boxes, for 100 yen apiece.  Then I found a Yahoo mailing list for fans of the trading card game... and promptly send them an offer which was about one step less unlikely than that from my forgotten grandfather from Nigeria.<p>A few spirited rounds of negotiation later, I went to the Post Office, dropped approximately half the profits on shipping (I was irrationally worried about being perceived as being a scammer, so I went for the expensive option), and cleared about a student loan payment.", "link": "item?id=3463161", "user": "patio11"}], "children": [{"number": 46, "names": "xiaoma", "comments": [{"comment": "It also shows up as an advertisement (above the results) when searching for \"chrome\", provided you don't have an ad blocker installed.<p><a href=\"https://www.google.com/search?sourceid=chrome&#38;ie=UTF-8&#38;q=chrome+\" rel=\"nofollow\">https://www.google.com/search?sourceid=chrome&#38;ie=UTF-8&#...</a>", "link": "item?id=3422658", "user": "dvdhsu"}, {"comment": "I concede immediately that I'm oversimplifying the issue. Google doesn't keep the \"problem\" Santorum result at the top of the SERP simply because they don't like Rick Santorum.<p>They're also (perhaps mostly) doing it to keep themselves out of the news, since the prevailing meme about that SERP now is \"oh well, that's how the Internet works\" and the result of a manual intervention would be a flood of news stories about an intervention Google probably doesn't want everyone knowing they do regularly.", "link": "item?id=3426801", "user": "tptacek"}, {"comment": "Just staying, our literally written policy was \"Offer DDD\": donate, destroy, or \"dispose of\" (a polite euphemism for \"You keep it\") the misshipped item.  I would have added the Christmas flourish if I were saying it in December, too, but the options would have been the same in July.  (n.b. The business does not care what you do.  We want to convey, in the politest possible way, that we both don't want it and don't want to talk to you about it.)", "link": "item?id=3434967", "user": "patio11"}, {"comment": "I'm sure trying to decide which snarky remark best conveys your condescending attitude towards a company's attempt to maintain its integrity and good standing is such a terrible dilemma.", "link": "item?id=3422557", "user": "ricefield"}, {"comment": "In cases where I've been hired for an identifiable project, that's what I've done.  But not all consulting fits that mould; the most interesting I've done has been in the category of \"be available for random stuff we throw at you, and send us a bill at the end of each month\".", "link": "item?id=3421504", "user": "cperciva"}, {"comment": "&#62;anybody for whom the solution set includes \"Or we could get this done cheaply abroad\" is likely to be a terrible customer.<p>Most, if not all customers are in the software business somehow and don't know the first thing about managing software as you said.<p>I have a recent customer wanting me to babysit a developer in house for him.  I told him I don't run daycares and he's free to setup a full development team in-house which I'll completely help with transitioning and then relieve myself.<p>He didn't write back.", "link": "item?id=3421345", "user": "j45"}, {"comment": "I think the problem isn't that they're doing both of those things at the same time. The problem, instead, is that the third thing they're doing at the same time is issuing guidelines, (hopefully?) backed by their ranking algorithm, written specifically to combat this type of behavior.<p>If it were a free-for-all, sure, no problem. But Google doesn't want other parties doing this. Doing it themselves puts them in a position that's a little difficult to explain.", "link": "item?id=3418593", "user": "danilocampos"}, {"comment": "I'm as big of a proponent of the magic that is supply and demand as anyone, but uber's pricing was not exactly transparent. Last night was the first time that I used the service. My first ride from my hotel in Chicago to my party destination at 9pm was $15, awesome. Not only was I thrilled by the quality of service, but I saw the message that fees would be higher that night and was expecting a higher price tag. Fast forward four hours later and I was ready to head back to the hotel. Same route, except this time the price was $54. Ouch.<p>The thing about market forces is that the buyer needs to be aware of the price in order to make a rational decision that affects demand and alleviates the strain on existing supply. Uber's app indicated I would be informed of the additional charge prior to my ride, but that certainly never happened. In that regard, I feel slighted and my feelings toward the company have been damaged as a result.", "link": "item?id=3414503", "user": "ABrandt"}, {"comment": "I was at the Twilio conference this year and there was a talk from Tim Lytle who only uses oDesk for his clients.   He claims to have a pretty good client base and is busy from the work.<p>Twilio also endorses oDesk as a platform for people to find qualified programmers <a href=\"http://www.twilio.com/blog/2011/06/twilio-partners-with-odesk-to-connect-developers-and-projects.html\" rel=\"nofollow\">http://www.twilio.com/blog/2011/06/twilio-partners-with-odes...</a>,  maybe the answer is to specialize and differentiate to become more successful when competing against $10 per hour international outsourcers.", "link": "item?id=3398552", "user": "bks"}, {"comment": "On top of this, users have also been trained to ignore anything that looks like a banner or ad. Sometimes giant text just looks like something meant to be ignored.", "link": "item?id=3527400", "user": "icegreentea"}, {"comment": "\"So many new customers that the new-customer alert gets really annoying\" is a great problem to have, though!", "link": "item?id=3520825", "user": "svmegatron"}, {"comment": "Even in that case, I am not aware of many instances where a developer being part of an acquisition helped him <i>significantly</i> in acquiring a VP position at a start-up.<p>Any start-up worth their salt is very deliberate in hiring. Now, if you don't care about where you are working and are merely chasing titles, I'd argue you can get a VP position without needing to be part of an acquisition.", "link": "item?id=3519722", "user": "badclient"}, {"comment": "I explained this to some as, \"values from from right to left across the equals sign. In this case 10 flows into a, 20 flows into b, then the value of b, 20, flows into a, making a 20 and b 20.\" I think it's a matter of saying what '=' means in words that people can understand since it doesn't mean '=' in the mathematically sense (which is '==' or '===' depending on language).", "link": "item?id=3520765", "user": "mentat"}, {"comment": "There are a ton of high-traffic websites out there that don't need an architecture any more complex than a standalone DB server + PHP + varnish (or the equivalent).<p>More so, if devs spent as much time tuning the performance of their apps as they did fantasizing about \"web scale\" architectural pivots they would typically be farther ahead. StackOverflow.com is a perfect example of this. They run on tiny handful of windows machines, support gobs and gobs of traffic, and have absolutely fantastic performance. And as much of that is due to paying attention to performance and making sure to find and remove the bottlenecks where they exist as it is to using cutting-edge architectures like database sharding, map+reduce, eventual consistency models, etc.", "link": "item?id=3520643", "user": "InclinedPlane"}, {"comment": "Those are fair points, although I did qualify my statement with \"In the absence of fraud\".  If the employment agreements forbid the behavior then that would be a clear case of fraud.  When it comes to implied expectations, I'm not sure it's so clear.  My understanding is that bilateral agreements with no-hire stipulations are not explicitly illegal, although the court may rule a specific agreement is depending on how it affects competition in a market.  So how many employees actually assumed no non-hire agreements when they signed on and was that a reasonable assumption?  I think that's a difficult question to answer.<p>Either way, I hate that the focus is on the \"letter of the law\".  If this were a patent troll case, or Hollywood copyright, or if SOPA had passed, how many people here would be demanding damages or jail time from the defendants?  They would be guilty of breaking the law just the same, and the plaintiffs could also claim that they need to be compensated for their losses (cost of filing for patent, \"lost revenues\" from pirated material, etc.)<p>I have to say, though, that my initial post was poorly worded.  As I was writing it, in my mind, I thought I was railing against antitrust laws in general and describing how non-hire agreements in the abstract were victimless crimes.  Reading those statements again, it seems more like I'm just talking about this particular case.  That's totally my fault, I apologize for that.  I tend to get worked up about issues like this and have to do a better job of choosing my words, or even stop myself from ranting in the first place.", "link": "item?id=3519208", "user": "jeffem"}, {"comment": "Sure, and...<p>1. It means they're scared. Companies wouldn't do this if they were afraid of a 10% bump in salaries. They'd just pay it out. That's small compared to the cost incurred by constant churn, code turning into legacy as people leave the company, etc. To pull that shit, they're worried about something larger.<p>2. If they were able to pull that \"cartel\" off (and such arrangements are inherently unstable, because it's always in the individual interest to break) it would be stupid for them and advantageous for startups. If the big companies hold each other back (\"crab mentality\") then startups would have less competition for talent.<p>In fact, the second contradicts the intentional over-hiring observed at large companies: why do these huge companies pay $150-250k for people to do mind-numbing, unnecessary maintenance work on zombie projects? (I've seen legacy monsters at large companies with 4 <i>full-time</i> maintainers.) Because they don't want these people in startups that might threaten them, 5 to 10 years down the road. Fighting to keep down salaries just seems to increase the likelihood of this happening.", "link": "item?id=3518292", "user": "michaelochurch"}, {"comment": "Sadly, I've been that person.  I read pg essays, blogs about programming and watched various videos about programming for about 3 years before finally deciding to leave my relatively comfortable small-business as an EFL cram-school partner and start actually coding stuff.  People have been absolutely amazed by how little I know compared to how much I sound like I know.<p>Fizzbuzz wouldn't have filtered me out of getting my first (and current) real software job, but any sort of Google/MS-style interview would have.  It may not be the wisest thing to admit to on the internet, but I'm basically in the opposite boat of your general target on HN: I'm fine with selling, but limited (non-EFL) skills to sell!<p>That, along with seeing numerous senior iOS dev applicants struggle both with Fizzbuzz and with Macs in general, has convinced me that it's more than worth it to test candidates without code portfolios.", "link": "item?id=3516139", "user": "xiaoma"}, {"comment": "The topic that patio11 mentioned is covered pretty well in chapter 2 of Freakonomics. The actual text doesn't seem to be part of the official sample excerpt, but somebody posted the relevant portion in a forum here: <a href=\"http://www.nachi.org/forum/f11/exerpt-freakonomics-book-regarding-real-estate-agents-57929/\" rel=\"nofollow\">http://www.nachi.org/forum/f11/exerpt-freakonomics-book-rega...</a><p>This is not an endorsement of other portions of the book as a whole.", "link": "item?id=3499305", "user": "mikeinterviewst"}, {"comment": "As someone who's been on the other side of the table (in multiple businesses), I really can't agree. In most cases, a business has a desire to fill a position fairly quickly, and especially in start-ups and small businesses, cost is a major concern.  In larger businesses or governmental organizations, HR regulations and bureaucracy become a major factor.<p>I've personally filtered out dozens if not hundreds of otherwise qualified people due to salary concerns without a second thought.  In two cases within the last six months I've seen the party who pushed for a higher salary reach out again only to find the position filled.<p>My guess is that you've never experienced an employer's market.  It may not be one in silicon valley, but it is for most engineers around the world.  Being a white guy in Japan, and then a guy with a popular blog following, you've had a far, far different experience than a typical engineer.", "link": "item?id=3499480", "user": "xiaoma"}, {"comment": "In the publishing world an author provides exclusivity in exchange to something. Usually the author gets some type of advance and the commitment from the publisher to publish and market the book.<p>Here you are supposed to give up commercial exclusivity merely for the ability to use a piece of software. And there really isn't anything special or expensive about that software either, there are plenty of free ebook creation software options.<p>Furthermore, in the usual publishing contract if the publisher that has exclusivity declines to publish something, the author can usually shop the work to other publishers. Not here. Here apparently if Apple says no, you are pretty much screwed, you cannot sell your work anywhere.<p>And by the way, I do not think that the original article authors are misreading anything. The agreement says:<p>\"Apple may determine for any reason and in its sole discretion not to select your Work for distribution\"<p>This means they can refuse distribution for any reason, and you do not need to do anything wrong to be refused. And of course if they refuse you do not have the right to sell your work anywhere else.", "link": "item?id=3496420", "user": "hristov"}, {"comment": "This is a good point. Personally, we often hire accountants to minimize our tax burden, yet when companies do the same thing, we like to label them as \"evil\" (at worst) or \"shirking their duty\" (at best).", "link": "item?id=3496542", "user": "bmj"}, {"comment": "Yeah, I did both of those in my salary negotiations with Google.  They talked me down from my starting salary, but they also increased my stock options &#38; GSUs.<p>The other important point is - you are the only one who says \"Yes\" when asked \"Is this acceptable to you?\"  If the free food is not worth $15-20K (which actually seems ridiculous - I've heard numbers for both what average employees value it at and what it actually costs Google, and they're nowhere close to that), then say \"I'm sorry, I don't value my food that highly.  I'll take the cash or go elsewhere.\"  This, of course, requires that you have somewhere else to go.  But remember that Google wants highly-qualified employees just as much as highly-qualified employees want to work at Google.", "link": "item?id=3496065", "user": "nostrademons"}, {"comment": "Don't forget paying Alec Baldwin to get kicked off a plane while informing everyone who listened that he just couldn't put down words with friends.", "link": "item?id=3495703", "user": "trotsky"}, {"comment": "That doesn't mean you'll know the nuances of the situation if you've not done VC raising before. Nuances and confidence come from previous successful experiences. To bring this back to the article - of course a VC would prefer someone who has experience, and who of course will be easier to talk to then.  It looks to be more closely aligned with if people know how to execute or how much experience they have with doing so, taking and processing information. Personally, I'm not good processing information and acting on it quickly - some of it, sure, but it takes time for certain types of information to sit. Sometimes I'm sure I overthink what needs to be done, instead of just initiating and playing off of what happens.", "link": "item?id=3486662", "user": "loceng"}, {"comment": "So there are a bunch of employees at my ISP who are fully \"authorized\" to read my mail. Also a bunch at the recipient's ISP. And probably some scanners in various systems in the middle that might surface my email for purposes of targeted advertising or spam fighting. It's not nearly the same level of protection.", "link": "item?id=3511056", "user": "sp332"}, {"comment": "Why should I have to do that, outside of work, in order to get another job?  I'm happy with my current work, and that means that I'm not trying to go out of my way to find additional projects on the side.  I have hobbies I'd rather be doing outside of work that don't involve computers.  I don't feel that it should be necessary to prove to any potential employer that I'm working outside of work.", "link": "item?id=3506487", "user": "cube13"}, {"comment": "Spoken like someone who hasn't undergone an IRS audit.<p>While I agree with David for the most part, his cavalier attitude of \"Well, if we get audited it will be cheaper than the cost of tracking shit\" is naive. Once he goes through an IRS audit, where they turn everything upside down and consume hundreds and hundreds of hours of time then he might change his attitude of the cost of an IRS audit. They are not nearly as cheap or insignificant as he makes it out to be.", "link": "item?id=3505326", "user": "Kynlyn"}, {"comment": "I meant coming from an academic job to a non-academic one. I'm doing well on the grant front, but I don't think that'll help me in getting a \"normal\" job.", "link": "item?id=3502486", "user": "lutorm"}, {"comment": "Patrick, rdouble is not being nice, but his major point is right. There are different forces in play for negotiating engineer's salary than a consulting engagement.<p>Employee compensation within a company needs to be equitable.  Similar work for similar pay.  Whereas terms of a unique consulting engagement don't affect anybody else. This is a huge driver of all kinds of compensation decisions, like standardized salary ranges, etc.<p>You are right about pattern matching.  But unlike for an investment banker or a marketing consultant, for an an engineer his negotiation skills do not correlate with the quality of his work.  More than that, an irrational but hard negotiator will come off as an dick. And employers avoid hiring irrational dicks as engineers.<p>But should you negotiate salary in general - sure.  But you should realize it's a different situation than a consulting deal.", "link": "item?id=3502337", "user": "gleb"}, {"comment": "Dude ... I've said it before (under my real HN account) and will say it again ... you-are-the-man!<p>I can't believe how stupid I've been all these years :( I'll admit that when recruiters have asked me this question, I've behaved almost like a deer in headlights.<p>My current job, I accepted the offer as is. THEN asked them if they had any salary negotiation room. Of course, I was told no. I felt like hitting my head against a wall right after that phone call. I won't be that big of an idiot again!", "link": "item?id=3502012", "user": "throwaway1979"}, {"comment": "patio11: just to play devil's advocate here, you have posted in the past that you have never made more than $60k per year[1]. This prompted a much attacked post [2] that is actually sort of structurally similar to this one (how to get more money for engineers), but aimed at you specifically rather than others, which made it strange.<p>Can I ask you the extent to which your points are field tested? Within the last 488 days, have your salary negotiations actually paid off, and who have you been negotiating with given that you are an entrepreneur with your own company?<p>This is not meant as ad-hominem and I like much of your writing. But you are like a sports trainer recommending a workout plan, and it is not unreasonable to ask whether you are actually in shape.<p>[1] <a href=\"http://news.ycombinator.com/item?id=1716991\" rel=\"nofollow\">http://news.ycombinator.com/item?id=1716991</a><p>[2] <a href=\"http://www.sebastianmarshall.com/the-genius-and-tragedy-of-patrick-mckenzie\" rel=\"nofollow\">http://www.sebastianmarshall.com/the-genius-and-tragedy-of-p...</a>", "link": "item?id=3502861", "user": "temphn"}, {"comment": "<i>\"you've got to torture the math to come to the conclusion that hiring acquisitions are where most of the money is changing hands.\"</i><p>Wait...what?  You're cherry-picking the top 10% of startups (maybe the top 1%), and criticizing this guy for torturing math?  For every one Dropbox, there are perhaps a handful of others that get aqui-hired, and dozens more that just fail silently.  That's just basic VC economics.  Maybe the bulk of the <i>money</i> gets transferred to the success stories, but that's little comfort to the hundreds of pretenders to the throne who don't go anywhere.<p>TeachStreet is a perfect example -- I met Schappell a startup breakfast in Seattle shortly after he launched the site.  At that same breakfast were at least a dozen other startup founders.  I've followed many of them since then, and nearly all have given up (in fact, one of those founders now works at TeachStreet).  Schappell made it to acquisition by a company for which he used to be a director.  There are usually reasons that these things happen.", "link": "item?id=3548166", "user": "timr"}, {"comment": "Any stories of Japanese immigration you'd like to link to/share that might help prepare someone planning on visiting the country?", "link": "item?id=3548526", "user": "mortenjorck"}, {"comment": "One of my favorite education quotes, supposedly from Larry Summers, comes from when he was asked about why it was that 60% of white students were jewish. Supposedly he responded that while there was no surefire way of getting into Harvard, it certainly helps to have every advantage one can get.", "link": "item?id=3544800", "user": "Alex3917"}, {"comment": "I've stopped doing minor multivariate testing in favor of A/B testing only major changes to a page.<p>It's just too tempting to play around with color changes all day instead of building my business.", "link": "item?id=3539557", "user": "scottkrager"}, {"comment": "It seems to me that to wait for yet another startup to solve this problem and hope it becomes popular enough to become successful and continue to hope it doesn't outgrow itself or get bought by a big company to get neglected is not the way out of this mess.<p>That's part of the reason I'm so excited about OpenPhoto and the consumer productization of self-hosting solutions. And BrowserID. And the Locker Project. It sort of looks like a decentralized social networking standard is in our near future.", "link": "item?id=3538885", "user": "joebadmo"}, {"comment": "I totally agree.  I think they're leaving money on the table with this particular strategy.  I even told them so last week to their face (their office is 4 floors below mine).  The answer I got surprised me.<p>First off, they test the hell out of everything.  They've tried dozens of variations with different offers, forms, and copy.  This is what won.  \"Beat the average\" is a compelling call to action.  Think about it, would you rather \"pay $10 to get X\" or \"beat the competition with $10\"?  The latter has bite to it.<p>It's also about brand.  The only way theses offers stand a chance with consumers and developers in the long run is by staying Humble.  It's in the name after all.  These guys take it VERY seriously.  And it's been paying off - their bundles have been doing better and better because people know the name.  They trust the name.  And they want to give money to support it, along with charity &#38; game delopers.<p>Does the road end there?  Certainly not.  But I have huge respect for these guys.  I totally trust that they know what they're doing here.", "link": "item?id=3537145", "user": "teej"}, {"comment": "<i>I mean, the author is entirely right: skilled devs can write their own ticket in this market. So, um, let's start doing that.</i><p><i>I also continue to think that \"I have code on Github\" is believed to be a career enhancer not because this is actually true but because it is something that is convenient to engineers to practice</i><p>For what it's worth...<p>A while back Seth Godin wrote something about resumes being irrelevant, and a lot of stuff about \"personal branding,\" blah, blah, blah.  It wasn't without controversy, although I don't remember if it was discussed here on HN or not.<p>Anyway, here's an anecdotal data point for ya.  I took Seth's stuff to heart.  Since then I've made it a point to do things like giving talks at Tri-JUG, Tri-LUG, RTP Semantic Web Meetup, etc.  And I do have code on Github (and a few other places) and I do network a lot and a lot of people know who I am and what I do.<p>Net result?  When I got laid off from my then $dayjob about 2 weeks ago, I made 2 phone calls in my car on the way home from the office, and essentially had a new job lined up within 2 hours.  No resume, no interview, etc.  Somebody knew my reputation and when I said \"I'm available\" the answer was basically \"Oh hell yeah, we want you.\"<p>I did eventually send in a resume and do an interview, but it was really just a formality to satisfy their HR process.<p>Also, they pointedly told me that I could skip even the formality of their coding test, because \"you have code online we can look at.\"<p>So yeah, my experience is, if you do the right things, and are good at what you do, you can avoid a lot of the bullshit that's usually associated with hiring.", "link": "item?id=3534978", "user": "mindcrime"}, {"comment": "Patrick, I completely agree with you, which is why I have never publicized my difficulties with problem customers.<p>But something in my reptilian brain really still likes this. Let me tell you why...<p>You say \"Work with better clients.\" Working with better clients means avoiding the bad ones. Avoiding the bad ones means being able to identify them. Being able to identify them means being warned.<p>It's almost like seeing an obstacle in the highway and wanting to warn others going in the opposite direction. But how do you do that? I once had the idea of putting a giant tattoo \"Avoid me.\" on my bad clients' foreheads.<p>The biggest problem with bad clients isn't that they took you, it's that they never go away; they just keep popping up over and over, only to take advantage of others.<p>One former client of mine is the perfect example. He never paid his bills, he was extremely abusive, he was often very unethical, and would do <i>anything</i> to make an extra buck. He would pop up all over the country with a different name, starting the cycle all over again. I recently noticed he just got out of jail with a brand new name and web site. If only I could find a righteous way to warn others, \"Run the other way!\"", "link": "item?id=3533832", "user": "edw519"}, {"comment": "I really enjoy reading and will be nostalgic about physical books. I also really like my kindle. For fiction reading I have not found it's match. But for non-fiction there is a UX feature where physical books currently dominate any book reader I've tried (laptop, tablet, kindle, smartphone).<p>Flipping to the index or table of contents, keeping a pen or finger in another page and flipping back and forth. Once that is figured out I will be a complete convert and stop preferring physical books.", "link": "item?id=3486016", "user": "Dn_Ab"}, {"comment": "Yeah, I've seen that, too.  A google search for \"viagra site:mit.edu\" has interesting results. .gov and .edu links are goldmines.", "link": "item?id=3482513", "user": "getsat"}, {"comment": "In-person meeting is top, and not THAT hard to get if you can plausibly represent a group.", "link": "item?id=3474112", "user": "rdl"}, {"comment": "My wife is a teacher, and I know a lot of other teachers in southern california. I don't know any that make anything close to $100k/year.<p>Here's the LA Unified pay scale.<p><a href=\"http://www.teachinla.com/Research/documents/salarytables/ttable.pdf\" rel=\"nofollow\">http://www.teachinla.com/Research/documents/salarytables/tta...</a>", "link": "item?id=3468134", "user": "jshen"}, {"comment": "Don't forget that Heroku/AWS aren't immune to outages themselves. Their major outage last year (due to an AWS/EBS issue) put my app out of commission for ~16 hours (fortunately it was still in a small, private beta).<p>I've got 6 VPSes and 12 dedicated boxes and have never had an outage that long (self-inflicted or otherwise) in roughly 6 years. Granted, most of my dedicated boxes are managed by Rackspace and cost &#62; $1k/month.<p>All that to say, I agree with your sentiments for the most part ... I just haven't seen the \"prevention\" of catastrophic events per say.", "link": "item?id=3466486", "user": "callmeed"}, {"comment": "My own utterly unscientific data suggests that this is a form of hyperbolically discounted loss-aversion - the 'loss' of the discount on additional units is felt more acutely than the more real loss of units purchased but never used.<p>Combining this principle with a time-limited offer can be staggeringly effective, I imagine by enhancing the sense of impending loss. I've seen orders-of-magnitude difference in revenue from such \"new customer only\" discounts.<p>Now if you'll excuse me, I'm going to have a bath in acetone to sluice off the shame.", "link": "item?id=3465454", "user": "jdietrich"}, {"comment": "Great story! A little bit of common sense can go a long way.", "link": "item?id=3463204", "user": "md1515"}], "children": [{"number": 21, "names": "patio11", "comments": [{"comment": "It's also the second result for \"browser\" in the news section. This isn't wrong, it's just one of the most insanely idiotic things I have ever heard.<p><a href=\"http://www.imdb.com/title/tt0112508/quotes?qt0403070\" rel=\"nofollow\">http://www.imdb.com/title/tt0112508/quotes?qt0403070</a>", "link": "item?id=3423098", "user": "el_presidente"}, {"comment": "I'd go with \"Apology accepted, Captain Needa.\"<p>Snark aside, I have to say that <i>was</i> my reaction - it's a more sincere apology than we usually get, and can be accepted as such.", "link": "item?id=3423113", "user": "Eliezer"}, {"comment": "But this has always happened on NYE to minicab fares.<p>In London it's almost impossible to get a black cab on NYE. Black cabs have their fares capped by regulation to something like 3x the regular fare. As such, it's not lucrative to work that night for such a small difference when they could be with their families.<p>Minicabs on the other hand are not capped, and are largely  unregulated. Many of them do work precisely because they can charge much higher rates, and they do.<p>I once got a minicab on NYE that cost over £170 for a journey that should have cost closer to £30. Caveat emptor.<p>What seems to be the case here isn't the market doing what the market does best (regulate supply and demand and the cost thereof), but the naivety and optimism of the consumer who hopes for cheap prices despite a severe spike in demand and a shortage in the supply able to meet the demand.<p>The last time I needed a cab on NYE, I chose to walk the 11 miles home. I was drunk, I was singing New Order most of the way. I actually really enjoyed the walk and saved myself a lot of money in the process. I've lost my naivety around cab fares on that night.", "link": "item?id=3415311", "user": "buro9"}, {"comment": "You should see this website:<p><a href=\"http://airforcefcu.com/\" rel=\"nofollow\">http://airforcefcu.com/</a>", "link": "item?id=3527576", "user": "LearnYouALisp"}, {"comment": "Except when the best of the best want to go from Apple to Google, specifically. And can't. It's not just about salaries, it's about prohibiting professional growth. And I would be very surprised if it didn't keep salaries down.", "link": "item?id=3518310", "user": "cynoclast"}, {"comment": "It is not an employer's market for talent in any place that needs talent.<p>You're probably right that line-of-business developers at Fortune-100 insurance companies on the east coast have a harder time than SFBA devs. But don't overgeneralize: in <i>software companies</i> in the US, it is a seller's market for talent.<p>So, two specific responses:<p>(1) You can in general safely push back on the first offer from any company --- this practice is so time-honored that it gets a chapter in _What Color Is My Parachute_, which is among the most anodyne sources of career counseling out there. Hiring managers, even at office furniture companies in Grand Rapids Michigan, are prepared for you to reject the first offer, and they've deliberately calibrated their first offer to deal with that.<p>(2) Technology companies everywhere will in 2012 go out of their way to work through salary negotiation. It doesn't matter if you're in SFBA, Seattle, Austin, Chicago, or Cleveland: if they're hiring for talent (ie, if they're actually a tech company), you're not going to spook them. Wherever they are, they have gotten used to the idea that candidates hold the cards and are likely at any point to decide to relo to Mountain View to work for 1.5x as much as you can pay them.", "link": "item?id=3501346", "user": "tptacek"}, {"comment": "Exactly.  It's the inclusion of an exclusivity clause inside a \"click-through\" EULA that's the, er, \"innovative\" aspect here.  And like others I find this pretty borderline immoral.  Contract law is about two parties on equal standing coming to a negotiated agreement, it's not well suited to the \"take it or leave it\" metaphor of software use.", "link": "item?id=3496605", "user": "ajross"}, {"comment": "It's simpler than this or the post describes.<p>Every \"benefit\" has an associated dollar value.  That's it. Total them up.<p>Oddly, salary is a holy cow whereas beenefits are not.<p>Having worked as an \"employee\" for 13 years before going freelance, the trend I see is this: employers generally feel its AOK to reduce/remove/substitute lesser benefits to save them money.  The same cannot be said for salary reductions.<p>This is a large part of what led me to go freelance. I control my benefits. I negotiate my rate. I get paid based on those and how hard I work.<p>At the end of the day, it's still a lot like being an employee but, for me, with far less a feeling of being victimized.", "link": "item?id=3497177", "user": "sleight42"}, {"comment": "\"Nuances and confidence come from previous successful experiences\"<p>And to add to that what one person is able to pull off given their skills is not always possible by another person even if they have been told what to do or how to do it.<p>Seat of the pants feel involves knowing how to react and adapt when the situation changes ever so slightly (a nuance). It's impossible to prepare someone for every possibility that might come up. That's something that comes, as you said, from \"from previous successful experiences\".<p>The best advice I can give is to learn concepts as opposed to a specifics and to understand exactly why something (say in a negotiation) should be handled a certain way. It's like the difference between learning what streets to turn on in NYC and learning the way the streets and avenues run so you can arrive at your destination even if you miss a turn.<p>Think of yourself as an actor playing a role.", "link": "item?id=3487591", "user": "larrys"}, {"comment": "You are welcome to put your email in an envelope (i.e. encryption). The technology exists and is proven.<p>If you send your regular mail without an envelope, there is a good chance many people will read it along the way too.", "link": "item?id=3511967", "user": "randomdata"}, {"comment": "It's not necessary.  Exercise isn't necessary, either.  It's a good idea for almost everybody, and even if you dislike the activity doing it probably improves outcomes for things you actually do like, but no one will force you to do it.", "link": "item?id=3506625", "user": "patio11"}, {"comment": "Huh? It's not the lack of paperwork that gets you audited. Your tax returns probably aren't itemized on a customer-by-customer, trip-by-trip basis.<p>If you get audited, you're in for tens of hours of annoying drama no matter what (in reality, it's your accountant that's going to do all the work).<p>If you're writing this on the assumption that a small business might handle an audit (or really even simple tax returns) on a DIY basis, get that thought out of your head now. You need an accountant at almost the moment you start seeing revenue in your business.", "link": "item?id=3506507", "user": "tptacek"}, {"comment": "There are three main ways for people to show their business value:<p>1. Absolute ability to add $ to the bottom line<p>2. Relative ability compared to others<p>3. Absolute technical skills<p>Academics transitioning to business do well focusing on 2 and 3, especially 2. If you show me that you were the top 1%  of the top 1%, I'm going to be impressed.<p>One quick concrete example: a friend of mine got the top scholarship for graduate students at her school. This was worth maybe $7,000-not a huge amount in business terms. But it marked her as one of the two best out of 10,000 graduate students.<p>Most people would just put the name of the grant, but what's impressive is the fact that only .05% of applicants got the grant. Once she put that as the first line on her resume, she got significantly more call-backs.", "link": "item?id=3505599", "user": "SatvikBeri"}, {"comment": "See the following, under \"Consulting\":<p><a href=\"http://www.kalzumeus.com/2011/12/21/bingo-card-creator-etc-year-in-review-2011/\" rel=\"nofollow\">http://www.kalzumeus.com/2011/12/21/bingo-card-creator-etc-y...</a><p>As those of us who've consulted can testify, consulting is like a never-ending series of salary negotiations.", "link": "item?id=3502906", "user": "mechanical_fish"}, {"comment": "Yup. We wasted a considerable amount of time going for silly optimizations like this when we should of been trying changing the entire copy and layout. It felt like we were doing something when in fact we were just spinning our wheels.", "link": "item?id=3539866", "user": "krsgoss"}, {"comment": "Thanks for the feedback. I live in the Triangle too. There's plenty of demand for developers here, with decent average salaries, but not great. So merely getting another job is no great feat. What I'd like to know is, was it worth it monitarily or do you think you could have got a similar job in a couple weeks without all the networking?", "link": "item?id=3535888", "user": "euroclydon"}, {"comment": "If you want to perform (for lack of a better word) a mitzvah for the community, rather than picking out a single abusive customer, use your experience and teach people how to pattern match.<p>Memo to young Rails developers: \"I have an idea for a website.  If you build v1.0 I'll pay you <i>a whole thousand dollars</i> and you might get equity if it works very well.\" has never had a happy ending. (Slight overstatement there, but it won't weigh on my conscience.)", "link": "item?id=3533858", "user": "patio11"}, {"comment": "Set a bookmark (one tap on my Nook), go to the table of contents, choose another page, return to your bookmark whenever you feel like it.", "link": "item?id=3486147", "user": "chc"}, {"comment": "Generally I've had no issues getting meetings, at least with a staffer, of my congressperson.<p>On a sidenote, does a group that focuses on gov't relations and PR exist that represents what would is largely the consensus HN community interest - i.e. making the case to elected officials and the public what sort of laws would improve prospects for technical innovation. The EFF focuses largely on digital civil rights, but that certainly isn't the only realm where Washington, Sacramento, Albany, etc. affect us.<p>Thoughts?", "link": "item?id=3474348", "user": "jowiar"}, {"comment": "\"wealthy suburban school district\" is important.<p>For example, <a href=\"http://acta.us/growls/2010/01/keeping_up_with_the_jones_in_m.html\" rel=\"nofollow\">http://acta.us/growls/2010/01/keeping_up_with_the_jones_in_m...</a> lists numbers slightly over $100k for maximum salaries for teachers in two Maryland counties.<p><a href=\"http://va.aft.org/fcft/index.cfm?action=downloadasset&#38;assetid=5df94d05-112c-487e-803b-d3e98d73d598\" rel=\"nofollow\">http://va.aft.org/fcft/index.cfm?action=downloadasset&#38;as...</a> is Fairfax County in Virginia; salaries are near $90k during peak earning years.<p>But even the pay scale you linked to has salaries near $90k at the top of the range....", "link": "item?id=3468658", "user": "bzbarsky"}, {"comment": "I love the retailers who try to tap in to this with the time-limited offers that never seem to expire!", "link": "item?id=3465545", "user": "sliverstorm"}], "children": [{"number": 11, "names": "smokinn", "comments": [{"comment": "I didn't even need to expend any mental effort to ignore the large advertisement-shaped blocks there.<p>AdBlock Plus did it for me, and delivered me a blank page.", "link": "item?id=3530889", "user": "ben1040"}, {"comment": "All I can say to Londoners is; if you think this is bad, wait for the Olympics.", "link": "item?id=3415589", "user": "tankenmate"}, {"comment": "Are you referring to the article \"Google demotes Chrome browser\"?  Because that's what I get.<p><a href=\"http://timesofindia.indiatimes.com/tech/news/internet/Google-demotes-Chrome-browser/articleshow/11360386.cms\" rel=\"nofollow\">http://timesofindia.indiatimes.com/tech/news/internet/Google...</a>", "link": "item?id=3423593", "user": "Natsu"}, {"comment": "I never mentioned the US.  I'm in Beijing and absolutely flooded with resumes from hard-working, talented people.<p>Before you automatically write off all of China (as well as India and other nearby countries), consider that engineering is moving at a rapid pace here.  Not only are some internet companies ahead of western counterparts (e.g. free to play gaming models), but there's simultaneously a boom in materials engineering, medical devices and clean-tech.<p>I realize that the US is particularly insulated from the market realities, due to a difficult immigration system amongst other things.  I can't really comment much on the specifics.  But those sorts of distortions don't don't generalize to the entire world, and they won't last forever.", "link": "item?id=3502069", "user": "xiaoma"}, {"comment": "This is a sales problem.  You can have the best product in the world and you still won't get the customers you want without a solid pitch and some networking.<p>Ted's post about not favoring github et al in applicant screening is one thing, but an aspiring employee who chooses to forego some easy and visible self-promotion has only himself to blame when he doesn't get the same opportunities as someone willing to meet hiring companies at their point of need.<p>To hire someone you have to find them, vet them, and entice them with the right deal.  People who make themselves easier to find and to vet are going to get better deals on average.", "link": "item?id=3510165", "user": "dpritchett"}, {"comment": "Well, even without the networking and stuff, I'm reasonably sure I would have eventually found something, yeah.   The open questions, to me, are \"how much longer would it have taken?\"  and \"would it have paid as well?\"<p>But my point was more that I was able to shortcut a lot of the usual rigmarole that it takes to get hired.  And to the extent that I did go through any of it, it was obviously just a formality and there was no pressure or whatever, like you might normally expect.   It's also just a nice ego boost to know you're wanted enough to where you can lose one job and have another lined up in a few hours.", "link": "item?id=3536582", "user": "mindcrime"}, {"comment": "<i>\"I have an idea for a website. If you build v1.0 I'll pay you a whole thousand dollars and you might get equity if it works very well.\"</i><p>If only all the assholes were so easily self-identifying.<p>The real problems are the charming, smooth talking, dream clients offering cool projects, top dollar, and paying on time...until they don't and decide to start making your life hell because you're in so deep already. They're no dummies.", "link": "item?id=3533943", "user": "edw519"}, {"comment": "It needs to be much much simpler than that.<p>What would be nice would be gestures. Maybe tap once, make a gesture and it remembers that gesture as a bookmark to that location. Later, make a line and the same gesture and it heads to that bookmark.<p>This way you can be looking at a chart, tap and make a number one. Head a few pages or another chapter down, tap and make a number two, a line and number one to look at the chart again and a line and a number two to head back where you were. Or maybe a standard \"back\" gesture.<p>Pressing multiple buttons and following many links is nowhere near friendly enough.<p>The gestures suggestion above still only works if you know you're going to be returning to a location when you get to it. Flipping through the book to quickly find a past location is a harder problem to solve.", "link": "item?id=3486504", "user": "smokinn"}, {"comment": "I'd be really wary unless it had a very very focused mission.  I think there's a lot of diversity among HN readers, and I hate being a part of organizations which claim to speak for me but end up supporting things I oppose, etc.<p>Right now, I think the startup visa thing and opposition to new stupid laws like sopa/pipa is all I have mental bandwidth to care about.", "link": "item?id=3477487", "user": "rdl"}, {"comment": "In all of these pay scales it is only the absolute top of the scale that reaches 100k, and LA never reaches it.<p>Very few teachers reach this. By contrast programmers reach 100k rather quickly, yet they aren't as large in the original link. Let's remember what patio11 was replying to,\" I was surprised to see the relatively large box of elementary school teachers. Surely those jobs don't pay that well.\"", "link": "item?id=3469123", "user": "jshen"}, {"comment": "Dreamhost suckered me that way. A few years ago they offered a limited time special anniversary discount (only 11 days left!!), however, the anniversary sale was still on months later and there were only 11 days left!!<p>I will never, ever use them again for doing that to me.", "link": "item?id=3465655", "user": "maalox"}], "children": [{"number": 6, "names": "euroclydon", "comments": [{"comment": "Agreed. I had a project a couple years ago, just like this.  Everything started off fine -- solid contract, good communication, etc. Payment was solid for the first few months, then it stopped.  I was accused of putting together templates with no functionality behind them, and they demanded their money back.  When I informed them where they could put their demands, so to speak, they threatened litigation.  I had done the work and knew the contract was solid, but I couldn't have afforded a lawyer.  Thankfully, they soon disappeared... But not before stealing their customers' funds. Ugh.<p>In retrospect, there were a few warning signs fairly early on, but it's hard to see that when you need the money to eat.", "link": "item?id=3534708", "user": "daeken"}, {"comment": "That's exactly where I am right now.  Like I said, I get enough satisfaction on an intellectual and professional level from my job that I don't feel the need to find side projects.  I'll do what it takes to get done with my job, working as many hours as I need to.  But I simply don't feel the need to code outside of working hours.<p>On weekends, I'd rather be out fly fishing or playing video games.", "link": "item?id=3506895", "user": "cube13"}, {"comment": "Apparently with no scripting, the middle of the page does not load.", "link": "item?id=3531009", "user": "LearnYouALisp"}, {"comment": "You're saying that it's harder to tap once to make a bookmark, twice to bring up the table of contents and once to select a new page than it is to stick your finger in a book, use the rest of your fingers to flip until you find the table of contents, note the page number and then flip through again without moving the finger you're holding in the book until you find the page you were looking for? I don't know what to say except that is very much not my experience.", "link": "item?id=3487666", "user": "chc"}, {"comment": "In fairness the comment about teachers in suburban districts was that two teacher salaries would be near 200k, not over 200k.<p>As far as the original comment about teachers, that's just basic statistics.  There are lots of teachers.  If you assume that people who earn &#62;$400k or so marry people from other occupations more or less uniformly, you'd expect close to 1% of teachers to show up on this chart, which would be a big box.  In practice, only 0.9% of teachers show up, but the real takeaway is that teachers are relatively well-educated and so not unlikely to actually be marrying people who end up with high salaries.  There are plenty of occupations on that chart in which a lot less than 1% of the people in the occupation end up in the top 1% of households.<p>So as far as comparing box sizes, you have to balance better pay for programmers against the fact that there are a lot fewer of them than there are teachers...", "link": "item?id=3474078", "user": "bzbarsky"}, {"comment": "Oh come on. They're a hosting company. How was their service?  Didn't you know what you were getting for the money? Would you have waited for <i>hosting</i> until a special offer came along?", "link": "item?id=3466155", "user": "euroclydon"}], "children": [{"number": 3, "names": "zecho", "comments": [{"comment": "\"In fairness the comment about teachers in suburban districts was that two teacher salaries would be near 200k\"<p>Precisely, and it's false. Two teachers, the vast majority of them, will not be near 200k. Look at my link, and it's obvious that if you randomly select 2 teachers, the vast majority of them will not be near $200k.<p>\"If you assume that people who earn &#62;$400k or so marry people from other occupations more or less uniformly, you'd expect close to 1% of teachers to show up on this chart\"<p>Right, but you're making my point for me. My point is that teachers are not showing up because of their own salary.", "link": "item?id=3476887", "user": "jshen"}, {"comment": "How much are we talking here? Many states have to be above $5 to 7.5 thousand to get lawyers involved out of small claims court. Also, many lawyers will do brief consultations on your case without charging you.<p>For future reference, don't back down when threatened with litigation. If it's actually a bullshit claim, they'll either settle out of court (on their own lawyer's recommendation) or they'll end up paying your lawyer for you when you win your case.", "link": "item?id=3535725", "user": "zecho"}, {"comment": "Customers tend to get pissed off when they realize they've been lied to. I think his anger is justified.", "link": "item?id=3466295", "user": "fragsworth"}], "children": [{"number": 1, "names": "bzbarsky", "comments": [{"comment": "&#62; if you randomly select 2 teachers<p>Then you won't get 2 teachers \"in their peak earning years\".  That part is important too.<p>There are two separate points here:<p>1)  Teachers are not ending up in the top 1% because they make enough on their own.  Very true.<p>2)  Teachers in rich suburban school districts will end up near $100k in terms of salary in their peak earning years (which for teachers generally means near retirement).  Still true.<p>No problem for both of those to be true, since $200k is nowhere near the 1% cutoff for household AGI.", "link": "item?id=3478269", "user": "bzbarsky"}], "children": [{"number": 1, "names": "jshen", "comments": [{"comment": "We're splitting hairs over wording and possible implicit meanings, and I'm pretty sure we agree on the real issue, so yeah.<p>One last thing, not only do they have to be in their peak earning years, they also need to max out the points from additional education. I don't know how many teachers do that.", "link": "item?id=3482830", "user": "jshen"}], "children": [{"number": 1, "names": "bzbarsky", "comments": [{"comment": "Yeah, I'm not entirely sure about the additional education thing either.  Most teachers I know are spending a fair bit of time on that, but I'm not sure how that translates into the +15, +30, etc system of points...", "link": "item?id=3483309", "user": "bzbarsky"}], "children": null}]}]}]}, {"number": 2, "names": "rmc", "comments": [{"comment": "<i>In retrospect, there were a few warning signs fairly early on</i><p>Care to elaborate to teach the communtity?", "link": "item?id=3535610", "user": "rmc"}, {"comment": "How was their honesty?  How was their transparency?  How was their respect for their customers?", "link": "item?id=3473434", "user": "Dylanlacey"}], "children": [{"number": 1, "names": "anthonyb", "comments": [{"comment": "Hindsight is 20/20, but typically any sign that they're weird and irrational (trail of angry developers/no business model), or that they'll try and screw you out of a fair payment (won't do commencement payments) are a red flag.<p>Even if you can't afford a lawyer, I would have something along the lines of terms and conditions, what happens on non-payment (usually work stops), etc. The \"Fuck you, pay me\" is a pretty good introduction to the field.<p>For web design you'll have milestone payments on commencement, initial design (with a couple of rounds of changes), conversion to HTML (with no changes) and installation on the site. Payment terms are 7 days, or as short as you can get away with. If they need more changes than agreed, or they change their mind, then they pay the balance and you requote for the new work. If they decide not to use your work, then they pay the balance. If they delay on any part of the work (eg. won't provide content for six months) then they pay the balance and you do the work later on. You get the idea, I'm sure.<p>If they balk at any of your conditions without a good reason, that's usually a sign that they'll be trouble and that you'll need to keep them on a tight leash and/or handle them with kid gloves.<p>On the flip side, if they're a good client, good payer and you're happy to work for them, then give them a lot of leeway. But the deadbeats get held to the letter of the agreement.", "link": "item?id=3536210", "user": "anthonyb"}], "children": [{"number": 1, "names": "rmc", "comments": [{"comment": "<i>trail of angry developers</i><p>Hehe. Reminds me of a former client (sorta) who would always wind up working for assholes. Everyone he had worked with turned out to be an asshole would couldn't do what he wanted. Turns out he was the asshole.<p>It's almost impossible for everyone else to be an asshole. It's like the old poker tip. If you look around the table and can't find the sucker, it's you. If you think everyone is an asshole, you're probably an asshole.", "link": "item?id=3537687", "user": "rmc"}], "children": [{"number": 1, "names": "anthonyb", "comments": [{"comment": "Bonus points if you find angry rants from the previous developer in PHP comments :)", "link": "item?id=3541770", "user": "anthonyb"}], "children": null}]}]}]}]}, {"number": 2, "names": "Herring", "comments": [{"comment": "I agree with what you said, even though I luckily still hadn't any client like that.<p>I think, though, that a good method is to ask for an advance and maybe payments as the work progresses. I guess bad clients never pay advances.", "link": "item?id=3534533", "user": "DeusExMachina"}, {"comment": "<i>&#62;Flipping through the book to quickly find a past location is a harder problem to solve.</i><p>iBooks has an 'overview' mode that sort of works if the book is well marked up. However it's not nearly as good as flipping, &#38; the processor needs to be much faster.<p><a href=\"http://ipadwatcher.com/wp-content/uploads/2010/08/ibooks-pdf-bookmarks.png\" rel=\"nofollow\">http://ipadwatcher.com/wp-content/uploads/2010/08/ibooks-pdf...</a>", "link": "item?id=3486915", "user": "Herring"}], "children": [{"number": 1, "names": "zizee", "comments": [{"comment": "Agreed, one should never start work with a new client without an advance. It doesn't need to be big, but get the client to put some skin in the game.<p>Also, regular progress payments are essential. You don't want to be in the hole 10k to someone when negotiating further work.<p><a href=\"http://jamespmcgrath.com/progress-payments-based-on-milestones/\" rel=\"nofollow\">http://jamespmcgrath.com/progress-payments-based-on-mileston...</a>", "link": "item?id=3536040", "user": "zizee"}], "children": null}, {"number": 1, "names": "gersh", "comments": [{"comment": "If they pay on PayPal or via their credit card, they can always do a chargeback.", "link": "item?id=3535141", "user": "gersh"}], "children": [{"number": 1, "names": "zizee", "comments": [{"comment": "Then don't take payment via credit card. Only accept cash transfers, cash, or bank cheques.", "link": "item?id=3536032", "user": "zizee"}], "children": null}]}]}, {"number": 1, "names": "marcomonteiro", "comments": [{"comment": "\"The real problems are the charming, smooth talking, dream clients offering cool projects, top dollar, and paying on time...until they don't and decide to start making your life hell because you're in so deep already. They're no dummies.\"<p>I can completely relate.  If only there were a place to keep track of clients and their payment history.  Glassdoor meets credit reporting.  Clients with no history get charged more and require a higher deposit.", "link": "item?id=3535586", "user": "marcomonteiro"}], "children": [{"number": 1, "names": "tomkarlo", "comments": [{"comment": "Agree 100%. The follow-on problem is that once you are owed a not-insignificant amount of money by one of these clowns, the temptation is to keep them happy and avoid conflict in the hopes you'll get paid out without having to resort to litigation.<p>I once worked for a few months with someone before I watched him not pay one of our contractors for no reason. When I raised the issue, he asked me if I'd be willing to take a 50% pay cut - on the work I'd already done for him.", "link": "item?id=3535785", "user": "tomkarlo"}], "children": [{"number": 1, "names": "anthonyb", "comments": [{"comment": "Yes, I've seen this happen at a couple of small businesses that I've been involved with. The trick is to have regular milestone payments, and if they miss them, work stops. (It'll annoy idiots like this to the point where they won't hire you, but that's kind of the point...)", "link": "item?id=3536132", "user": "anthonyb"}], "children": null}]}, {"number": 1, "names": "bitops", "comments": [{"comment": "Sounds like you have an idea for a startup. :)", "link": "item?id=3536066", "user": "bitops"}], "children": null}]}, {"number": 1, "names": "knewter", "comments": [{"comment": "We invoice weekly.  Depending on our terms with the client, if they aren't paying on time we stop work.  This results in at-most 2 weeks of unpaid work, and typically they have a lot invested in seeing it through to completion because already have (largeish-n)% of their money.  We also send emails EVERY TIME a work unit is created in xrono (our open source app-to-run-a-software-consultancy) showing both the current work and their current uninvoiced total.<p>Our clients never, ever, ever tell us that they were unaware of how much money they'd agreed for us to spend without us laughing a lot.  It typically ends well.", "link": "item?id=3534819", "user": "knewter"}], "children": [{"number": 1, "names": "anthonyb", "comments": [{"comment": "I refer to this as a \"cash leash\", and it's a very good idea, particularly in the early days before you can hire lawyers to create contracts and write letters to non-payers.", "link": "item?id=3535590", "user": "anthonyb"}], "children": null}]}, {"number": 1, "names": "nfm", "comments": [{"comment": "Fortunately, 90% of bad clients are the former.", "link": "item?id=3535289", "user": "nfm"}], "children": null}]}, {"number": 1, "names": "minus1", "comments": [{"comment": "Here's my mitzvah:<p>Don't do work for individuals or very small companies.  People are much more reasonable when your fee isn't coming out of their pocket.", "link": "item?id=3534269", "user": "minus1"}], "children": [{"number": 1, "names": "benohear", "comments": [{"comment": "Doesn't match my experience: I have several small clients who pay within a couple of hours of receiving a bill. However they are profitable small clients (and very nice people).", "link": "item?id=3534644", "user": "benohear"}], "children": null}, {"number": 1, "names": "unreal37", "comments": [{"comment": "I stopped making websites for friends or 2-person companies for this reason. Besides the pain on their faces when I estimate them how much its going to cost, these are the same people who get an idea in the middle of the project and want to add a dancing and singing cat to the home page.", "link": "item?id=3534923", "user": "unreal37"}], "children": null}, {"number": 1, "names": "adambard", "comments": [{"comment": "This is a good rule of thumb, but the best client I ever had was in the general area of legal services. No more than 6 employees, or at least that's how many email accounts I set up, but paid well, without complaint, and always immediately.<p>I think it comes down to, looking out for clients that focus on cost instead of value.", "link": "item?id=3534932", "user": "adambard"}], "children": null}, {"number": 1, "names": "easy_rider", "comments": [{"comment": "- I agree, I've had bad experience with both. Be wary of individual/companies who work for clients and outsource their technology to you. Often the specifications will be very vague, and even if you manage to communicate a better level of understanding what THEIR CLIENT actually wants (which takes time and effort..) - you might end up not getting paid, because their client doesn't accept the solution, and doesn't want to pay the guy who hired you.<p>- Always have signed agreements, ALWAYS, can't stress that enough. Unless you have very good reasons of trust.  Chat logs, e-mail conversations, all cool, all legal, but you will always get a yes-no story. Signed agreements are often very clear cut.<p>= Never agree on doing a revenue share with individuals or smaller companies. They probably won't have a clue what they're doing.<p>- If you don't believe in the product when you get your first impression on it, you never will. Don't let 'em fool you and convince you otherwise.", "link": "item?id=3535210", "user": "easy_rider"}], "children": null}, {"number": 1, "names": "ilaksh", "comments": [{"comment": "I would love to stop doing work for small companies or individuals.  But how do I get bigger clients?  I really don't know how.", "link": "item?id=3535542", "user": "ilaksh"}], "children": [{"number": 1, "names": "sounds", "comments": [{"comment": "Advice sometimes isn't worth the (web) paper it's printed on.<p>But take a long, hard look at the clients you are most successful with. Identify the larger market that fits that criteria. Then, how are you going to compete with the people already in that space?<p>I think of it the same whether doing a startup, consulting, or pivoting a business.", "link": "item?id=3536009", "user": "sounds"}], "children": null}, {"number": 1, "names": "sopooneo", "comments": [{"comment": "It took me a while to make the jump. I started by earning my dues working too hard for two little pay with some small-time clients early on. I built up a decent portfolio that I could show off and started using that to market myself. I sent it as a link to adds I saw on craigslist. I did a couple projects on spec that I worked really really hard on and sent links to the company offering it for free. You'd think that would be a huge risk, and frankly, it is. But in fact, both of the times I did it, I got major clients. Kept building myself from there.", "link": "item?id=3537258", "user": "sopooneo"}], "children": [{"number": 1, "names": "ilaksh", "comments": [{"comment": "You got major clients from Craiglist?  If I misunderstood, where exactly did you send your portfolio to which resulted in major clients?", "link": "item?id=3539919", "user": "ilaksh"}], "children": [{"number": 1, "names": "sopooneo", "comments": [{"comment": "Yes I did. It was very hard work. I combed through hundreds of adds, sent custom replies to several dozen of the most promising and made it clear that I was offering high quality, with the unstated caveat that I was not offering the lowest price. I replied only to adds local to Boston (where I live) and said that I would be happy to come to their location at their convenience. When I did in person interview I dressed very well, and read up extensively on their companies beforehand. I did not even entertain anyone that seemed like a cheapskate or wanted to offer equity.", "link": "item?id=3548898", "user": "sopooneo"}], "children": null}]}]}]}]}, {"number": 1, "names": "chc", "comments": [{"comment": "This particular criterion has the benefit of helping you filter out about half of the job listings on Craigslist all on its own.", "link": "item?id=3533937", "user": "chc"}], "children": [{"number": 1, "names": "reinhardt", "comments": [{"comment": "Only half? For Craigslist this sounds on the low side.", "link": "item?id=3534399", "user": "reinhardt"}], "children": [{"number": 1, "names": "chc", "comments": [{"comment": "Heh, I'm sure it depends on your market. Here I'd say it's 50% obvious jokers, 49.5% who could be all right (but could just be less obvious jokers) and 0.5% who really sound like good clients.", "link": "item?id=3535361", "user": "chc"}], "children": null}]}]}, {"number": 1, "names": "jeffreymcmanus", "comments": [{"comment": "\"Pattern matching\" is like astrology for smart people.", "link": "item?id=3534625", "user": "jeffreymcmanus"}], "children": [{"number": 1, "names": "pjscott", "comments": [{"comment": "Pattern matching is a general term for what you do every time you see a letter and recognize the pattern of light, or hear a word and match it to a concept. Don't give it a bad name just because human pattern-matching is flawed and unreliable in the (relatively rare) edge cases.", "link": "item?id=3534808", "user": "pjscott"}], "children": null}, {"number": 1, "names": "paulbaumgart", "comments": [{"comment": "\"Pattern matching\" is just another phrase for applied Bayesian probability.", "link": "item?id=3534815", "user": "paulbaumgart"}], "children": null}, {"number": 1, "names": "pavlov", "comments": [{"comment": "Maybe you can drop the \"for smart people\" -- the same kind of magazines that blather about horoscopes tend to run lots of stories along the lines of \"How to recognize a narcissist\".", "link": "item?id=3534720", "user": "pavlov"}], "children": [{"number": 1, "names": "jeffreymcmanus", "comments": [{"comment": "no, dumb people just use guessing, actual astrology, etc.<p>smart people use \"pattern matching\" because it makes bigotry (which is a form of guessing) seem smart.", "link": "item?id=3534780", "user": "jeffreymcmanus"}], "children": [{"number": 1, "names": "rhizome", "comments": [{"comment": "I think you're dancing around the word \"discrimination\" which is actually a fundamental aspect of thought and language, and is how humans can tell, for instance, the difference between good and bad. Are you saying that people shouldn't have standards?", "link": "item?id=3535124", "user": "rhizome"}], "children": null}, {"number": 1, "names": "lukifer", "comments": [{"comment": "poTAYto, poTAHto. The fundamental engine of consciousness is fuzzy pattern matching; when done poorly, it's called \"guessing\", and when done well, it's called \"intuition\".", "link": "item?id=3536425", "user": "lukifer"}], "children": null}]}]}]}]}, {"number": 11, "names": "noahc", "comments": [{"comment": "<i>Here you are supposed to give up commercial exclusivity merely for the ability to use a piece of software. And there really isn't anything special or expensive about that software either, there are plenty of free ebook creation software options</i>.<p>Then USE THOSE. The only exclusivity you give is of the file output you made with that software.<p>Not of your literary work itself.", "link": "item?id=3496780", "user": "batista"}, {"comment": "<i>In most cases, a business has a desire to fill a position fairly quickly</i><p>It depends. As another data point, I've applied for jobs where the job advert was from 6 months ago. There is a shortage of IT talent, this company had been waiting 6 months. They can afford to wait a few weeks more.", "link": "item?id=3500688", "user": "rmc"}, {"comment": "It happened to me once when reading a FAQ for rootnode support IRC channel. There was a most important \"point 0\" in FAQ, that was emphasized by moving it above the page header. It was supposed to be the very first thing visitor will read, but my mind didn't even register this text being there (even after being told that there <i>is</i> a \"point 0\" and revisiting the page). Needless to say, I got into some trouble because of that, but I managed to convince FAQ maintainers that banner blindness[1] is a real thing, and they fixed the FAQ.<p><a href=\"http://en.wikipedia.org/wiki/Banner_blindness\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Banner_blindness</a>", "link": "item?id=3528308", "user": "TeMPOraL"}, {"comment": "If Google's integrity and good standing depends on not manipulating search results, there isn't a relevant case study for making such a determination - Google is still manipulating search results relative to Chrome.", "link": "item?id=3424080", "user": "brudgers"}, {"comment": "If you are being considered by Google and are negotiating financial terms I would venture that you have plenty of other options available to you (read Facebook and MS)", "link": "item?id=3496478", "user": "josefresco"}, {"comment": "&#62;And why is the Post Office singled out for this concern? Are other government profit centers treated the same way? Perhaps the Patent Office?<p>It probably has to do with the number of employees. IIRC, the Post Office is one of the largest employers in the country.", "link": "item?id=3511603", "user": "Goronmon"}, {"comment": "That depends, my aunt was audited and ended-up with close to a million dollar refund.  Here attitude had long been, paying a little extra in taxes is worth not keeping track of every expense.  When your actually making real money tracking every lunch has a minimal ROI.<p>PS: She did still took many large deductions and had reasonable records, she just played it safe when submitting her taxes.", "link": "item?id=3505568", "user": "onemoreact"}, {"comment": "I'm in the exact same situation. My way forward is to get an external consultancy project worth $XM and use that as an example.", "link": "item?id=3502717", "user": "nagrom"}, {"comment": "I'm not Patrick, but I play him on tv.<p>A couple points, First of all I am a heat seeking missile for praise. For me, I've never optimized my life or life style for money.<p>Think of negotiation as levers that can be moved. I've discovered how to move the levers, but I haven't moved them because I'm not optimizing for money.<p>This is an article about moving the levers, not about optimizing the levers.", "link": "item?id=3502907", "user": "noahc"}, {"comment": "Me too. Major changes tend to have higher impact and provide more/faster learning. What exactly do I learn if I find that one color gives me 0.4% more conversions?", "link": "item?id=3545403", "user": "metadata"}, {"comment": "<i>I recently noticed he just got out of jail with a brand new name and web site.</i><p>This is an amusing and dramatic example of why, while it's all good fun for one's reptilian brain, the tactic of trying to call out problem customers by name isn't going to help very much: People with negative reputations have nothing much to lose by starting over.<p>Whereas those with positive reputations <i>do</i> have something to lose. And the problem with throwing mud is that some of the mud inevitably gets on the thrower.<p>This is why the effective way to warn people about problem customers is in secret, generally over drinks.", "link": "item?id=3534555", "user": "mechanical_fish"}], "children": [{"number": 3, "names": "jfoster", "comments": [{"comment": "You might also look at it another way, and Google probably will, too.<p>If you're being considered by Google and you don't negotiate, perhaps they are the ones making the mistake.", "link": "item?id=3496512", "user": "jfoster"}, {"comment": "Unfortunately, that depends on the definition of 'Work' in this context which is far from clear.", "link": "item?id=3496909", "user": "clavalle"}, {"comment": "Good point, but if you're too cool to keep receipts, you're probably being a cowboy in other areas of business.", "link": "item?id=3506128", "user": "Duff"}], "children": [{"number": 1, "names": "dexen", "comments": [{"comment": "Thanks for framing it that way; I felt this relationship subconsciously but never could name it clearly.<p>Btw., that's pretty much what happened at my current workplace: after two years of employment I negotiating salary increase -- basing on market situation and possible other employers for me -- and ever since the owners appreciate my role in the company more.", "link": "item?id=3496633", "user": "dexen"}], "children": null}]}]}, {"number": 3, "names": "thomaslangston", "comments": [{"comment": "Asking for something like 30% up front is a very good way to filter out problematic clients. I regularly don't even bother to collect the up front payment once they've accepted it, but if the client refuses then it's a red flag.<p>Often it's the client himself who chases me up to make the payment. That's a <i>very</i> good sign.", "link": "item?id=3534686", "user": "benohear"}, {"comment": "Amount you spent might also be useful, if you can prove you spent it wisely.", "link": "item?id=3502696", "user": "thomaslangston"}, {"comment": "<i>\"Here you are supposed to give up commercial exclusivity merely for the ability to use a piece of software. And there really isn't anything special or expensive about that software either\"</i><p>If that is true, what is the fuzz about?", "link": "item?id=3496867", "user": "Someone"}], "children": null}, {"number": 2, "names": "mcgraw", "comments": [{"comment": "I like <a href=\"http://clientsfromhell.net/\" rel=\"nofollow\">http://clientsfromhell.net/</a><p>Same idea as this, but funnier and more about learning to laugh about the stupidities of some clients and moving on.", "link": "item?id=3534085", "user": "henrikschroder"}, {"comment": "\"Apple may determine for any reason and in its sole discretion not to select your Work for distribution\"<p>You wouldn't find this in Amazon's EULA? They would publish anything? There's no way Apple would leave that door open.<p>\"And there really isn't anything special or expensive about that software either, there are plenty of free ebook creation software options.\"<p>You're selling a different experience here. If you're writing a static book then there is no reason to go this route right now. If you're creating something interactive then this might be something to look into.", "link": "item?id=3497150", "user": "mcgraw"}], "children": null}, {"number": 1, "names": "zupreme", "comments": [{"comment": "I think by, \"Work with better clients\", Patrick really means, \"Stop doing work for cheap clients\".  I agree with him that payment from clients in the 5-digit range tends to go much smoother than from those at the bottom of the barrel.<p>I would also add that, when you charge a higher rate, you also can justify higher initial deposits and milestone payments along the way.  This gives your client more \"Skin in the game\" which makes them more likely to honor the contract terms so that they can receive the final deliverable.<p>When I first started doing freelance development I made a practice of undercutting everyone else to get the gigs.  This did earn me a fair supplemental income, but it was not a business model as clients at this level (&#60;$1k) tend to have very little vendor loyalty and will just move on to the next cheap provider when you eventually try to raise your rates.  Since restricting myself to projects of $5k or above things have gone much smoother and I'm alot happier.", "link": "item?id=3533946", "user": "zupreme"}], "children": null}, {"number": 1, "names": "lsc", "comments": [{"comment": "while I agree that calling out unethical behaviour might be best for the industry as a whole, for an individual?  calling out someone else is almost always self-destructive.   There are two sides to any story, and just like how an insurance company will avoid a customer that gets in accidents even if it wasn't their fault, in business, people often avoid people that get in a lot of disputes, even if they were the wronged party.", "link": "item?id=3535025", "user": "lsc"}], "children": null}]}, {"number": 23, "names": "oneiroscopist", "comments": [{"comment": "I just ran into it for the first time.  I bought an MHL cable from Monoprice, and it was DOA.  I requested an RMA; they asked one question to make sure it wasn't pilot error, then said they'd send a new cable, and I didn't need to send the old one back.  I was pleased; my gold standard has been Amazon, where they pay the shipping, but I'm still out the time it takes to go to the post office.", "link": "item?id=3435223", "user": "metageek"}, {"comment": "<i>Google 2012 is not Google 2002. Results which would get mentioned on the nightly news get fixed, period.</i><p>I disagree. We certainly like to fix bad results, but not manually. There's a very narrow range of things Google is willing to do manually in search. One of them is taking action on sites that are found to have violated the webmaster guidelines, but banning a result from a query just because it's embarrassing isn't something we do.<p>For instance, in that example you cite, jewwatch.com is still at number 2 for [jew].", "link": "item?id=3427701", "user": "moultano"}, {"comment": "Maybe. Maybe they don't go through the home page; maybe they go through the Google home page but don't look at it.<p>But the problem is the same when other companies that make an honest mistake in good faith, get punished in this manner:<p>1. there wasn't anything they could have done to prevent this mistake (if the Chrome team can't figure out the rules, who can??)<p>2. the people who end up being punished are Google's users themselves, who won't understand why they can't find BMW when searching for \"bmw\", and will probably think they did something wrong.<p>I'm not defending spammers, BTW, or even SEO (which I think is borderline evil regardless of the color of its hat).<p>What I'm trying to say is that Google should find a way to punish spammers without punishing its own users.", "link": "item?id=3423437", "user": "bambax"}, {"comment": "I imagine the FTC and FCC are an incentive to do <i>something</i> to ameliorate the situation.", "link": "item?id=3422555", "user": "kmfrk"}, {"comment": "Why won't you deal with it? Bad experience? On the customer or developer side?", "link": "item?id=3396924", "user": "oneiroscopist"}, {"comment": "This also happened to me. I have since made sure that I have absolutely no part of the order process for any of my software. I don't want to be notified. I don't want to have to click a button. I don't even want to think about it, except at the end of the month when I count my money.", "link": "item?id=3520819", "user": "gburt"}, {"comment": "My bet is on lutorm, the point is that the original questions are ambiguous and if you remove some of the ambiguity you increase the chances of someone getting it right.<p>My theory is that those who got it right (at least most of them) didn't get it because they \"formed a consistent model\". But simply because they made the same assumptions people before them did when creating the language. But of course, would need more data to be more sure of anything.", "link": "item?id=3519861", "user": "vibrunazo"}, {"comment": "One thing I've found is that scaling rarely means solving difficult problems.  Rather, it means putting more time into finding optimal solutions to problems that are trivial at smaller scale.  For example, should your startup use Apache, nginx, or HAProxy as a load balancer?  If you're just launching, the answer is \"Who cares, just ship the fucking thing!\". If you reach the point where you start measuring page views in the billions (and yes there are start ups that are at this point), it matters a great deal.  Or should you use Postgres, MySQL, or some shiny NoSQL thing?  Again, probably doesn't matter for small websites.  But for larger services, it matters.<p>Also, don't underestimate how large log files can grow in a data-driven business (like AirBNB seems to be).  I could easily believe that they have many terabytes of data just from logging actions their customers have taken.", "link": "item?id=3519273", "user": "j_baker"}, {"comment": "The opposite, of course, is true.  I've never been in a situation in the real world where, given a problem, I jumped immediately to a white board and felt I had to come up with a  solution while being tested by people I didn't know.  I have, however, had the joy of being given questions that could literally not happen, with requirements that cannot be met, all with the intent on seeing how I can think.  Oh, and with no time to think, either.<p>If you really want to test how someone thinks over questions like that, actually give them time.  Give them the questions before they show up for the interview.  Then go over their solutions.  They aren't under pressure, they give you a thoughtful answer, and you get a better sense of what they can do in the real world.", "link": "item?id=3514034", "user": "jasonlotito"}, {"comment": "I can see where you are coming from but ultimately I disagree. The strong counter-argument in the comments here has prompted me to write a follow-up post clarifying my position in detail so hopefully that will help eradicate the notion that I would weaken a candidates negotiating position for my own benefit regardless of whether I do it consciously or otherwise.", "link": "item?id=3499818", "user": "Peroni"}, {"comment": "It's hard in a big company in that the decision maker is really the hiring manager, but HR protocol gets in the way. So if the prospective hire is unhappy with the offer they have to formally decline it and then the hiring manager has to come back at HR to get them to tender a better offer. Things can happen in that process - other candidates, having to change leveling to reach the desired offer, etc. If your decision maker is the one actually in charge of the whole process then I absolutely agree that there is no downside to negotiating. Look forward to your blog post!", "link": "item?id=3499336", "user": "derekja"}, {"comment": "The exclusivity clause is being misinterpreted. They aren't demanding exclusivity for the content of the book, only for the Author-provided layout.<p>With my reading of this, you are free to sell your book in as many places as you like, as long as you don't use Author to publish for those other platforms. Since Author is being distributed for the <i>express purpose</i> of publishing to iBooks, I can't see why this would be a problem.", "link": "item?id=3496486", "user": "culturestate"}, {"comment": "Way to put a positive spin on the article :)<p>Don't forget the lesson though -- if you use an extra-curricular in a negotiation it's no longer extra-curricular.", "link": "item?id=3495874", "user": "dlss"}, {"comment": "I imagine a lot of employers wouldn't really like you discussing stuff you had done for them in any great detail on the public internet, even discussing design / architecture decisions might be controversial (or covered by an NDA).<p>Plus if your employer finds what you wrote you better need a justification for putting it up there that isn't \"so I can apply for this job\".<p>You don't really want to end up in legal trouble or fired.<p>At this point anyway your \"web presence\" is pretty much just going to be your resume but put online, I imagine if they explicitly don't want resumes they wouldn't want that either.", "link": "item?id=3506447", "user": "jiggy2011"}, {"comment": "I know what you're saying, but sales guys benefits from the perception that they're solely responsible for the close of a sale. That's their job after all. So the $5M in sales? It wouldn't have happened without them! (that's the perception)<p><i>if that is your day to day activity, you were improving performance of the company's flagship product which launched to over $5 million in sales</i><p>Already there are more steps. You know he didn't sell that himself, a sales person did, and the link between performance and number of sales is unclear without knowing the product. So, to me, the $5 million number is nice ('ok so he was trusted to work on that important product') but feels a bit irrelevant when asking for a specific offer increase.<p>For whatever reason, it doesn't convince me that this candidate in particular couldn't have been replaced by another candidate for the same result. In the example of a sales person, I'm more easily convinced that s/he was influential in the result. edit: I guess it's because sales is so much more of a \"people\" job than engineering.<p>But maybe I'm just pointing at what you've been saying: take a job closer to the money…", "link": "item?id=3501879", "user": "Timothee"}, {"comment": "Yeah, I was kind of enjoying this oddball view of the universe, however much handwaving it required, until we hit the last paragraph, where the author tried to address the phenomenon of startups that actually <i>work out</i>:<p><i>It’s from among those ugly ducklings that the swans of the new age emerge: FB, Goog, Twitter, Yahoo! and others — no one wanted them at first — then they couldn’t get enough of them.</i><p>There is only so much handwaving that one can get away with. \"Ugly ducklings\" that \"no one wanted\"? You just can't pretend that existing companies didn't, e.g., know that Facebook was worth serious money, pretty quickly. They offered Zuckerberg real money for Facebook. According to a book quoted by this extremely-irritatingly-formatted article at Business Insider, the buyout offers started <i>four months</i> after Facebook started:<p><a href=\"http://www.businessinsider.com/all-the-companies-that-ever-tried-to-buy-facebook-2010-5#\" rel=\"nofollow\">http://www.businessinsider.com/all-the-companies-that-ever-t...</a><p>And Dropbox? Everyone and his brother has dreamed of buying Dropbox. The most famous rumored suitor is Apple:<p><a href=\"http://www.macrumors.com/2011/10/18/dropbox-indeed-balked-at-major-acquisition-offer-from-apple/\" rel=\"nofollow\">http://www.macrumors.com/2011/10/18/dropbox-indeed-balked-at...</a>", "link": "item?id=3547268", "user": "mechanical_fish"}, {"comment": "And if you're asking \"what is?\", the answer is probably your copy.", "link": "item?id=3539429", "user": "sachinag"}, {"comment": "Those non-techy people close to you who seriously care -- what are they doing with their photos now?", "link": "item?id=3539268", "user": "brlewis"}, {"comment": "\"In real life, the people whose decisions matter a) often can't read code and b) almost always have better uses of their time than reading code from someone who is, statistically, not likely to be hired.\"<p>The person who can't read code shouldn't be deciding the technical merits of a candidate. If that's happening, your hiring process is broken.<p>Furthermore, your hiring process should be designed such that you can weed out the majority long before the in-person interview occurs. Steps in the hiring process should be scheduled such that the more time consuming parts come later.<p>I google any candidate who has made it to an actual in-person interview. If they have a github page, I look inside to see what they've done. It helps tremendously if the candidate tells me which projects they are most proud of. What's nice about this approach is it gives us something to talk about that the candidate is passionate about.<p>It's only when the candidate has nothing to show off that things move towards a more \"traditional\" interview, with dry coding and design questions.", "link": "item?id=3534755", "user": "kstenerud"}, {"comment": "Most of the customers that will pay you 20-40k for web work would never bother trying to stiff you; it would cost them more in process exceptions and legal review (which happens the first time the word \"lawyer\" occurs in an email message) than it does to simply pay you. But most of all, <i>it's not their f'ing money</i>. The company pays, not them.<p>So I might be substantially more wary about working for someone who's paying out-of-pocket than I would for a real customer.", "link": "item?id=3534213", "user": "tptacek"}, {"comment": "and yet I would still rather have a book.", "link": "item?id=3487201", "user": "serge2k"}, {"comment": "Two working people earning $200k together isn't what I would describe as particularly wealthy.  That would put them squarely in what most people consider slightly upper-middle class.  Consider that two engineers right out of college should be able to make that much.", "link": "item?id=3468023", "user": "burgerbrain"}, {"comment": "Heroku, GAE and other SaSS are great, if and only if they have everything you need. For my own purposes, most of the things that I do now involves PostGIS which mean I have to use a PostgreSQL server. The cheapest option for PostgreSQL on Heroku starts at $200. That's just way out of my budget for now. I'd love to know how people do GeoSpatial searches and other GIS stuff using MySQL or other NoSQL solutions.", "link": "item?id=3466907", "user": "wyuenho"}], "children": [{"number": 11, "names": "patio11", "comments": [{"comment": "Agreed. Amazon could use a similar policy rather than having to ship stuff back. For example, I ordered something from Amazon worth $200. A few days later, the price dropped to $100. I already had it unboxed and wired into my setup so I called Amazon and said do a price match. Instead, they wanted me to ship the old one back and reorder the new one. I'm like why? Now, I have to be out $8 shipping it back to them, they are out whatever to ship the new item back and they still give me $100 back. But that was policy and that is what I had to do. Makes no sense. Seems like UPS comes out ahead.", "link": "item?id=3435480", "user": "periferral"}, {"comment": "Short version: it adds nothing I need, positioning myself against the competition there would be certifiably insane, and the type of clients I most successfully work with would avoid me like the plague if I proposed working through oDesk.", "link": "item?id=3396967", "user": "patio11"}, {"comment": "&#62; Also, don't underestimate how large log files can grow in a data-driven business (like AirBNB seems to be). I could easily believe that they have many terabytes of data just from logging actions their customers have taken.<p>Logs don't have remotely the same access requirements as the databases used to serve a product.", "link": "item?id=3520441", "user": "adgar"}, {"comment": "But you're just one out of tens of thousands of recruiters. You have to believe something pretty radical to think that recruiters on the whole are immune to incentives.<p>We can safely assume that you're conscientious and that you go out of your way to defend the interests of candidates. Then we can move on to telling developers how to deal with normal recruiters.<p>This particular debate, just remember, is about whether you should disclose your current salary to a recruiter or prospective employee. The answer is: you simply should not do that, full stop. If you disagree, it would be helpful if you disagreed directly and provided evidence for your view; that would be more constructive than centering the discussion on your own professionalism and ethics, which nobody wants to call into question.", "link": "item?id=3501328", "user": "tptacek"}, {"comment": "I agree.  The demos all show text being imported from some other text file (likely whatever the writer has already written to distribute elsewhere).  Then Author is just used to add an additional level of interactivity for iBook distribution.<p>A writer could write their whole book in Author, but that's misusing the tool.  Author is a great tool for adding additional interactive content to an already written book.  It's a lousy tool for writing content you want to also put elsewhere.  It seems like most complaints come from the assumption that the writer will be using Author as their primary writing tool.  That's not how to get the most out of Author.", "link": "item?id=3496604", "user": "viscanti"}, {"comment": "Nope, still extra-curricular, just like the food is still theirs to make available or take away as they see fit.  This is a shady tactic you and the employer can both use.  I wouldn't though.<p>let me elaborate.  if someone looks me in the eye and says, \"Don't forget that we never work weekends, how much is that worth?\" then they are not my friend.  That's a given, it's part of a 40-hour job not to work weekends.  To put a price on it and have me concede part of my salary means they don't have my interests at heart.<p>Now, you might say that negotiators don't have to have the other guy's interests at heart.  Then maybe you can read Getting to Yes (\"the Harvard principle\") or even the old How To Win Friends and Influence People.<p>the toughest negotiators usually end up having no one to talk with but mud with a stick in it.  If all you want for an employee is a mud with a stick in it, by all means, harp on about how elephants do not trample around your premises, there are no monsoons in the area, and other employees don't use the outhouse or squat outside to potentially poop on them.<p>But if you want a quality employee, an actual human, then the negotiation that works on mud with a stick in it will not be very compelling.  Or honest.  Pretty soon you won't be negotiating with another human again.", "link": "item?id=3496439", "user": "its_so_on"}, {"comment": "The line I used in my past life as an enterprise Java developer was that Internet participation was a necessary part of my professional development, enhancing my future value to the company without them needing to spend money on expensive training or conferences.  Plus it gives me a chance to learn about some of that web stuff that your IT magazine is always talking about, boss.  Imagine the TPS reports I could implement with that!  (It worked.  Japanese megacorps: secret hippies, I tell you.)<p>More broadly: fear, weakness, and lack of creativity in the face of constraint are not career-enhancing attributes.  (That's not personal.  Many engineers need to hear it, including me, both in the past and occasionally in the present.)", "link": "item?id=3506570", "user": "patio11"}, {"comment": "This is how I put it<p>\"For 9 months I led development on a project that did x, y, an z.  I delegated work to 5 other engineers and spent about 30% of my time coding/architecting.  The released product took in $15M in revenue the following year.\"<p>\"For the last 2 years I've been on a team of 5 software engineers who work on one of my company's top portfolio products, which nets a revenue of $200M per year.  I was the architect of one particular feature which boosted sales $25M the following year, and coded half of it while leading 2 other engineers to finish it to completion.\"<p>It helps not to think of $$ as being a direct tie-in to what value the engineer provides, because again, we aren't _that_ close.  It does help to understand that there is some tie-in - ie. as an engineer, that you get that you are essentially building stuff to make money and you are cognizant of the consequences of your work.  On another level it demonstrates that you have status to be in positions of that much importance.  But you don't want it to come off like bragging, it simply is some metric that could easily be read off from a project post-mortem.", "link": "item?id=3501995", "user": "brandall10"}, {"comment": "Attaching refined petroleum products to dead plant matter using denatured animal proteins remains popular.", "link": "item?id=3539307", "user": "patio11"}, {"comment": "&#62;\"Two working people earning $200k together isn't what I would describe as particularly wealthy\"<p>You probably should, since the median household income is something like $50k or so, a quarter of what they make.", "link": "item?id=3468738", "user": "ZachPruckowski"}, {"comment": "MongoDB might be interesting for you to look at. It has geospatial stuff baked in.<p><a href=\"http://www.mongodb.org/display/DOCS/Geospatial+Indexing\" rel=\"nofollow\">http://www.mongodb.org/display/DOCS/Geospatial+Indexing</a>", "link": "item?id=3467182", "user": "jonknee"}], "children": [{"number": 7, "names": "oneiroscopist", "comments": [{"comment": "People who misuse Author still deserve fair treatment.", "link": "item?id=3496721", "user": "mikeash"}, {"comment": "I had originally included a lengthy argument against disclosing your salary to recruiters specifically. That element was removed due to the fact that the post was aimed at graduates who most likely won't have to deal with recruiters for a number of years. In my follow-up post I am dealing with both topics specifically. Not negotiation but purely the facts as to why I think it's best to withhold your salary from a recruiter and disclose it to an employer.<p>Fortunately I am not <i>just one out of tens of thousands of recruiters</i>. I've been in this game for three years, prior to which I was on the other side of the fence managing a team of 8 people, regularly interviewing potential employees and entering negotiation battles as an employer with a strict budget.", "link": "item?id=3504095", "user": "Peroni"}, {"comment": "Indeed, but it's worth pointing out that in this case \"different\" doesn't necessarily imply \"easier\".  Instead of having to access the data across many concurrent connections, you have to be able to store the data efficiently so that it doesn't take up too much space and you can do jobs on them that don't take 3 weeks to complete.  And let's not get into how you collect and merge them together.  There are open source tools to do these things, but you're still looking at a decent amount of infrastructure to make it work.", "link": "item?id=3520484", "user": "j_baker"}, {"comment": "Thanks, Patio. I gather you were on the workforce side, correct?", "link": "item?id=3397002", "user": "oneiroscopist"}, {"comment": "I've actually had Amazon suggest I donate a shipment that arrived a week past the projected shipping date, with a replacement already on the way.<p>That was almost 10 years ago, though. Maybe policy has changed, or your case is a different process for them where they need it shipped back.", "link": "item?id=3436631", "user": "brazzy"}, {"comment": "Are they shooting digital?  How do they choose pics to print?  What's the process from camera to final product?", "link": "item?id=3539338", "user": "brlewis"}, {"comment": "In what proportion are those: A. two person households, and B. two fulltime worker households?", "link": "item?id=3468978", "user": "cma"}], "children": [{"number": 1, "names": "batista", "comments": [{"comment": "Yeah, and they still can get their text out of the program, and format it again in some other program.<p>Nobody demands or will demand the literary rights of the content of people writing primarily in iBooks Author.<p>Just that they don't use the output file of that program for selling it elsewhere.", "link": "item?id=3496785", "user": "batista"}], "children": [{"number": 1, "names": "mikeash", "comments": [{"comment": "The license terms are not clear as to whether they lay claim to the output or to anything you create with the app, which would include the content if you use it as your word processor. Certainly a lot of people are giving them a charitable interpretation of it, but if that was their intent, I don't see why they didn't state it explicitly.", "link": "item?id=3497116", "user": "mikeash"}], "children": null}]}]}, {"number": 1, "names": "rmc", "comments": [{"comment": "<i>\"they wanted me to ship the old one back and reorder the new one. I'm like why?\"</i><p>Because if they put a barrier to entry some people won't do it and they'll have saved themselves $100?", "link": "item?id=3438022", "user": "rmc"}], "children": null}]}, {"number": 2, "names": "kerryfalk", "comments": [{"comment": "Good managers know that it takes more than the sales guy to close the deal to make that $5MM deal work. The sales people know this, too. Aftermarket support and/or production issues mid-stream are the bane of our existence. When it goes well everyone deserves the credit.<p>Now that I have that experience if I saw a non sales person place something like the above on their resume I would be very intrigued. Not because they're claiming responsibility (which I don't read into that) but because it says to me that they see their place in the whole system and how they contribute. That is really rare and really valuable. Like you say it's harder to see it when you're not in front of the customer, but if you do see it I think it means you're probably an \"A\" player.<p>For example, I used to sell heavy equipment to the concrete industry. In the back shop there was a manager of a unit that did about 25% of the work that needed to be done to build any machine that I would sell. He didn't have any direct contact with the customers. He didn't sit in on any sales meetings, and didn't have a very good idea of the forecast that was coming (unfortunately). He was absolutely critical to making each sale happen and each customer happy and he seemed to understand this. Without him it would have been very difficult to land the deals that we did. He absolutely deserves to place that he was critical to building an $8_figs business area on his resume. And by doing so I think it shows that he has vision beyond his area. I'd work with him again in a second.<p>He was \"far\" from the money but it didn't seem that way to me. He could just write on his resume that he was a Tool and Die Maker that managed a small machine shop of about 6 people. And it's true, but it doesn't do him justice.", "link": "item?id=3502163", "user": "kerryfalk"}, {"comment": "Really depends on cost of living.  I looked at a breakdown of this recently by locale.  In the bay area or NY it doesn't get you anywhere close but in most other areas it puts you in or pretty close to the 1%.", "link": "item?id=3468384", "user": "moocow01"}], "children": [{"number": 2, "names": "mechanical_fish", "comments": [{"comment": "Well, he said wealthy suburban.", "link": "item?id=3468401", "user": "burgerbrain"}, {"comment": "This is why everybody should study science for a while. ;) The tack to take is \"we did this experiment, and we built the best thing we could, a thing that accomplished feats X and Y and Z, but the experiment didn't yield the results we hoped for.\"", "link": "item?id=3502938", "user": "mechanical_fish"}], "children": null}, {"number": 1, "names": "groaner", "comments": [{"comment": "Considering that figures floating around say that as many as 90% of software projects fail, there's probably many of us in that group.  (I consider myself one of them.)<p>There's <i>got</i> to be a way to put a positive spin on a project that was late, over-budget, rejected by the customer, poorly specified, technically misdirected, utterly mismanaged, and ultimately written off as a huge waste of time, money, and energy.  But just saying \"I learned a lot about how <i>not</i> to do things\" doesn't really impress anyone.", "link": "item?id=3502030", "user": "groaner"}], "children": [{"number": 1, "names": "HeyLaughingBoy", "comments": [{"comment": "Just addressing the technical misdirection:<p>\"We made a number of technical errors. We decided to try using a brand new datastore called NoDB. Unfortunately, it turned out that our learning curve on NoDB v1.234 was steeper than we expected. It's an amazing product, but it's new and not yet well documented so it took us a long time to learn its quirks. I became an expert on NoDB because of all the tuning I had to do to try to improve performance and it's a fantastic product. I think that YesDB would have been much faster to learn but by the time we realized that, the project was cancelled.<p>However, with what I learned from that experience and what you've told me about your project, I think that NoDB would be a perfect fit. It has yaddayaddayadda features.  What do you think?\"", "link": "item?id=3502399", "user": "HeyLaughingBoy"}], "children": null}, {"number": 1, "names": "jiggy2011", "comments": [{"comment": "Yep. It's seen as bad form to criticize former or current co-workers at a job interview but sometimes the only honest answer is \"all my co-workers were either lazy or incompetent but I'm better than them hence why I'm looking for another job\".<p>It also sucks when you do client work in web development and build a good website for somebody who then proceeds to use the CMS to create pages full of spelling errors and nasty images their nephew created in pirate photoshop so you cannot use it as a portfolio piece.", "link": "item?id=3502086", "user": "jiggy2011"}], "children": [{"number": 1, "names": "HeyLaughingBoy", "comments": [{"comment": "OK, this may be harsh, but it's true.<p>You come into an interview with me and say that, and you've just talked yourself out of a job. I don't care how impressive your resume is; don't care if otherwise you walk on water. If you can't even avoid expressly criticizing your teammates in a job interview, it sends signals that you don't know when to keep your mouth shut; that you have no idea what it means to be tactful. That in turn suggests to me that you're going to be a pain in the ass to work with and are more focused on \"who's right\" in a discussion than coming to a consensus.<p>I really, really, really hate the phrase \"not a team player\" but right or wrong, that's exactly what that statement would advertise.", "link": "item?id=3502354", "user": "HeyLaughingBoy"}], "children": [{"number": 1, "names": "awj", "comments": [{"comment": "I'll back that one up. That exact attitude is something I'm personally working on right now, mostly as a result of discovering how much it affects people's perception of my work and abilities.<p>Talking crap about your previous co-workers is a great way to waste interview time and convince someone you will be difficult to work with. You're in a job interview. This is best-foot-forward, \"paint me a picture of how awesome you could be\" time. Don't bitch about your last job, we aren't here to talk about that.<p>If the honest answer truly was \"everyone else was incompetent\", just talk about your role in the project. If everyone was <i>really</i> that terrible and you were <i>really</i> that good, you should have some <i>awesome</i> stories about how you helped keep things on track. Maybe the whole damn thing was a sinking ship, but you have to have done something to help keep it afloat. Tell those stories.<p>Anyone with half a brain will catch on that you're talking around a bad work environment. They'll appreciate your tact and file away a note that letting you talk to customers/sales/management/whoever may not be as horrible as it would with most engineers. That's a <i>very</i> good mark in your favor.", "link": "item?id=3502433", "user": "awj"}], "children": [{"number": 1, "names": "jiggy2011", "comments": [{"comment": "Oh, don't get my wrong I'd be way <i>way</i> more tactful than that in an actual interview.<p>It just sucks when you feel like you might have to defend a lot of bad decisions that were made by others and all your good ideas were overruled, I don't want to sound like \"Mr Hindsight\".", "link": "item?id=3503748", "user": "jiggy2011"}], "children": null}]}]}, {"number": 1, "names": "sethg", "comments": [{"comment": "I believe the proper euphemism for this situation is “I am looking for new challenges”.", "link": "item?id=3503139", "user": "sethg"}], "children": null}, {"number": 1, "names": "cpach", "comments": [{"comment": "If a client taints the beautiful layout, maybe prototype screenshots can be used for your portfolio?", "link": "item?id=3506380", "user": "cpach"}], "children": null}]}]}]}, {"number": 1, "names": "chc", "comments": [{"comment": "Curiosity: Have you actually been in the position of interviewing people who said things like that and being unimpressed, or do you just feel like they're not impressive things to say about yourself?", "link": "item?id=3501933", "user": "chc"}], "children": [{"number": 1, "names": "Timothee", "comments": [{"comment": "The latter.", "link": "item?id=3502256", "user": "Timothee"}], "children": null}]}, {"number": 1, "names": "lelele", "comments": [{"comment": "&#62; So the $5M in sales? It wouldn't have happened without them! (that's the perception)<p>Maybe there was a either a strict deadline or a challenging technical issue to overcome such that that sale couldn't have happened without your contribution.<p>Maybe that software was sold for $5M because it was way more stable, responsive and easy to deploy and use than its competition.<p>Maybe, thanks to good engineering and best practices, bugs and requests for improvement were quickly answered.<p>Maybe, again thanks to good engineering, that software was easily tailored to each customer's need, and customers were willing to pay (way) more.<p>Maybe... Start to look at your job and at your product with sales goggles and find other selling points.", "link": "item?id=3502576", "user": "lelele"}], "children": null}]}, {"number": 10, "names": "solutionyogi", "comments": [{"comment": "Patrick, I don't get this comment. Is there an inside joke I am missing?", "link": "item?id=3520336", "user": "solutionyogi"}, {"comment": "It still ranks 3rd for the term 'jew', right after 'jew watch', which I assume is a hate site.", "link": "item?id=3426826", "user": "jaggederest"}, {"comment": "Perhaps for the applications of yesterday (like Basecamp) this is the case, but the real innovation taking place is around collecting massive amounts of data and processing it in interesting ways. These systems are used every day to make quantified business decisions rather than best guessing based on someone's hunch. 37signals builds questionably good UIs on-top of a database, something people have been doing for decades now. The future is in augmenting intelligence by gathering massive amounts of data and reducing it for human consumption.", "link": "item?id=3519311", "user": "rbranson"}, {"comment": "I don't know, this sounds very clear-cut to me:<p>&#62; if your Work is provided for a fee (including as part of any subscription-based product or service), you may only distribute the Work through Apple<p>What do you base your interpretation on?", "link": "item?id=3496310", "user": "StavrosK"}, {"comment": "Looking forward to it, as I just received an offer that was largely based on my github profile. Hiring manager told me they've never interviewed someone with one. So I suppose I can turn that around and say I deserve more than the typical offer.", "link": "item?id=3496864", "user": "djb_hackernews"}, {"comment": "Agreed. He should have read PG's YC Numbers [1]. The overwhelming majority of value in YC's portfolio comes from the top 10% all of which have likely turned down numerous acquisition offers. YC would much rather an IPO or late stage acquisition vs. acqui-hire liquidity event.<p>[1] <a href=\"http://ycombinator.com/nums.html\" rel=\"nofollow\">http://ycombinator.com/nums.html</a>", "link": "item?id=3548031", "user": "twakefield"}, {"comment": "<i>If you're doing it right...</i><p>Wouldn't that depend a lot on the position you seek to fill?", "link": "item?id=3534706", "user": "sliverstorm"}, {"comment": "I'm not sure how useful public shaming and griping are, but I do think it works on the  iamayoungconsultantandnoonetalksaboutthis.com level. I'd have found the stories super useful as an insecure 25 year old \"forced\" into the freelance market.", "link": "item?id=3534221", "user": "alanstorm"}, {"comment": "$100k/year for teachers is somewhat rare.<p>However, $50k/year pensions for teachers is not all that rare and lots of retired police and fire folk do as well or better.<p>How much \"net worth\" does it take to throw off $50k/year guaranteed by taxpayers?", "link": "item?id=3469269", "user": "anamax"}, {"comment": "Couldn't you migrate BCC to EC2 and then migrate pieces of it into Elastic Beanstalk (or AppEngine, or Heroku) as you wrap thin service layers around each piece?", "link": "item?id=3466835", "user": "aphexairlines"}], "children": [{"number": 5, "names": "sukuriant", "comments": [{"comment": "Remember, it is a contract. It only looks like English language.<p>I don't have a full copy of the EULA, but in another article they state that \"Work\" is \"any book or other work you generate using this software\". They are talking about the output of the program, they are not restricting your original content.<p>So, if you want to sell a PDF of your book through other channels, you better not make the PDF with this software. Use the \"Print to PDF\" popup in your regular software or something.", "link": "item?id=3496958", "user": "jws"}, {"comment": "He violently threw his phone when it wouldn't stop ringing and he was in a mental state that didn't want to experience said ringing.<p>In other words: understand that it will ding for all new users. all of them. Get a lot of dings. Get them at 3 in the morning. Get them during a date. All dings.<p>To relate: if you're the kind of person that turns off your IM sounds because they annoy you, this is not for you. I am one of those people: even a window blinking too frequently bothers me.", "link": "item?id=3520365", "user": "sukuriant"}, {"comment": "so... wouldn't it make sense for the other 90% to be acqhired vs taking up space in the bottom 90% of the yc stable?", "link": "item?id=3548537", "user": "mgkimsal"}, {"comment": "If you (who are hired rather than hiring) are doing it riht...", "link": "item?id=3535920", "user": "barry"}, {"comment": "Thanks to <a href=\"http://news.ycombinator.com/item?id=3469401\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3469401</a> , we know that a $50k/year pension is worth &#62;$1.5M NPV.<p>So, those folks are near 1%ers.  They just don't own the assets that will generate the money that they'll be spending.  We do, or rather, we own the liability.", "link": "item?id=3471438", "user": "anamax"}], "children": [{"number": 2, "names": "twakefield", "comments": [{"comment": "Yes, but the company doesn't necessarily know whether it's going to be in that top 10% when acqui-hire offers occur. They usually occur on the upward trajectory of a company. So most investors would rather the company roll the dice on a bigger exit later than \"settle\" for the acqui-hire now.<p>The entrepreneur's perspective may be different.", "link": "item?id=3548571", "user": "twakefield"}, {"comment": "Oh, of course. The discussion is about the output of this program, though. If you format your book with it, you lose all the formatting if you want to publish on other channels, as the article said.", "link": "item?id=3497061", "user": "StavrosK"}], "children": null}]}]}, {"number": 8, "names": "drivebyacct2", "comments": [{"comment": "&#62;Results which would get mentioned on the nightly news get fixed, period.<p>I can't think of a single publication or media outlet that hasn't covered Santorum's \"Google problem\".", "link": "item?id=3427325", "user": "drivebyacct2"}, {"comment": "I don't disagree with anything you've stated.  Explosive growth and requiring massive amounts of data storage are surely the exception not the rule.<p>That said, the blog post talks about enormous growth and it still fits inside Moore's Law's growth.  I guess my gut is just saying it's not really that enormous in terms of startup scaling if it's still within those limits.  Not to take anything away from 37Signal's success, but it feels like nothing of value was really added by this post.  I present the post of a picture of 864GB of ram as supplementary evidence that is near the top of HN right now.", "link": "item?id=3519308", "user": "ohashi"}, {"comment": "&#62; Exclusivity is still a very cruddy contractual term for authors, if viewed against the universe of \"all possible contractual arrangements\", but it is far from uncommon in the publishing world.<p>It is common in the publishing world to only tell the author about the exclusivity after they've completed their book?", "link": "item?id=3497123", "user": "MatthewPhillips"}, {"comment": "Maybe this will help, it's more general:<p><a href=\"http://www.korokithakis.net/posts/secrets-power-negotiating/\" rel=\"nofollow\">http://www.korokithakis.net/posts/secrets-power-negotiating/</a>", "link": "item?id=3496319", "user": "StavrosK"}, {"comment": "<i>This would be a very penetratingly insightful criticism if you had never heard of Airbnb, Dropbox, Twilio, etc etc. </i><p>i.e \"if you had never heard of the 1% of exceptions to your rule...\".", "link": "item?id=3547444", "user": "batista"}, {"comment": "Fully agree with you Patrick, I've had some bad experiences with payments that turned out to be blessings in disguise.<p>As one of my mentors said about taking people to court \"How much of your time / resources would it take to sue them? How much would you gain? How long would it take you to generate that much rev?\" When I realized that it took less time to generate the rev than to sue I decided to drop the matter and focus on finding better clients.", "link": "item?id=3534352", "user": "fleitz"}, {"comment": "I've never heard teachers described as \"working poor.\" Just middle income.", "link": "item?id=3467709", "user": "drumdance"}, {"comment": "Which part of the Slicehost to Rackspace migration required the additional time that had not been invested?<p>Also, what do BCC and AR refer to?", "link": "item?id=3466572", "user": "kfool"}], "children": [{"number": 3, "names": "rat87", "comments": [{"comment": "Bingo Card Creator and Appointment Reminder.", "link": "item?id=3466600", "user": "ciniglio"}, {"comment": "The way I tend to look at it is \"paying for education\".", "link": "item?id=3534654", "user": "benohear"}, {"comment": "I'm not sure whether he is right ,but I think that's his point(ie he believes that most similar problems get special tweaking and Santorum doeesn't for whatever reason)", "link": "item?id=3427543", "user": "rat87"}], "children": null}]}, {"number": 4, "names": "scarmig", "comments": [{"comment": "Link? I am interested in salary negotiation techniques.<p>Thank you.", "link": "item?id=3496148", "user": "aurelianito"}, {"comment": "The real question, I think, is when investors are figuring out whether to go into the startup scene, what are the dominant influences on their decision?<p>If there's a long tail of Airbnbs that drives most of the expected profits generated by an investment strategy, then the status quo understanding of things--buy a bunch of lotto tickets, and make a bundle when one hits the jackpot--is probably an accurate representation of the market strategy.<p>If the median investor isn't going to make any money from getting a big hit, though, it's a different story. Most value is going to come from talent acquisitions. In which case, the article is right, and the incredible sea of funding available today is effectively a pooled set of resources by big corporations that are funneled to VCs in exchange for recruitment and building of effective teams. Which would make VCs the best-compensated HR managers in history.<p>There's also no reason both can't be true. Maybe the majority of profits are generated by Dropboxes, but the typical VC understands that those are lotto tickets and is relying mostly on the latter scenario.", "link": "item?id=3547935", "user": "scarmig"}, {"comment": "This is one of the reasons I always ask for a percentage up-front (usually along the lines of 30-50%).  A client that is willing to do this will more than likely pay you when the project is finished.<p>Before I did this, I had tons of clients that just wouldn't pay me or lie and tell me the \"check is in the mail\"..when it really wasn't.<p>When I was young and naive 6+ years ago, it put me out of business and I had to get a job.", "link": "item?id=3534767", "user": "paulhauggis"}, {"comment": "You'd have to be pretty killer to pull that off,  however.  I know for a fact that out of college Microsoft picks up engineers from MIT for 84k, and NASA gets new greats (not necessarily from MIT) for 76k.  (disclaimer- I am not from MIT, but these ate both very reliable sources)", "link": "item?id=3471524", "user": "rhino42"}], "children": [{"number": 1, "names": "patio11", "comments": [{"comment": "It won't be published until Monday (US time).  Your options for finding it then include emailing me, getting the RSS feed at kalzumeus.com, following me on Twitter (@patio11), or (not a given but also not the riskiest prediction I'll make this year) checking the HN front page.", "link": "item?id=3496167", "user": "patio11"}], "children": [{"number": 1, "names": "HeyLaughingBoy", "comments": [{"comment": "I particularly enjoyed the confidence embodied in that last one ;-)", "link": "item?id=3497647", "user": "HeyLaughingBoy"}], "children": null}, {"number": 1, "names": "aurelianito", "comments": [{"comment": "Great. Thank you. I have subscribed to your RSS feed.", "link": "item?id=3508313", "user": "aurelianito"}], "children": null}]}, {"number": 1, "names": "calibraxis", "comments": [{"comment": "I'd suggest the books _Getting to Yes_, and Graeber's _Debt: the First 5000 Years_.<p>Of course the second book sounds odd, but if you're renting chunks of your life, it's vital to know about the real nature of markets, not the Disneyfied version. Many people I've spoken with are uncomfortable with the antagonistic nature of negotiation, and fail to hit the upper limit of what the employer's willing to spend. Instead of wilting, there should be a feeling of indignance.", "link": "item?id=3496570", "user": "calibraxis"}], "children": null}, {"number": 1, "names": "StavrosK", "comments": [{"comment": "I posted it above, but, since you're interested, I found this book helpful:<p><a href=\"http://www.korokithakis.net/posts/secrets-power-negotiating/\" rel=\"nofollow\">http://www.korokithakis.net/posts/secrets-power-negotiating/</a>", "link": "item?id=3496324", "user": "StavrosK"}], "children": null}]}, {"number": 3, "names": "guelo", "comments": [{"comment": "It's an interesting point he makes, but you're right, he has no numbers to back it up. Doesn't anyone keep data startups and acquisitions?", "link": "item?id=3547029", "user": "nelsondooley"}, {"comment": "Sounds like you're threatening to put me on iamachumpconsultant.com while discouraging me from putting you on iwasntpaid.com.<p>Just like corporations can ruin consumers' credit ratings almost without recourse, the concept here is to ruin these delinquent payer's reputation via a registry everyone can check.", "link": "item?id=3535162", "user": "guelo"}, {"comment": "My anecdotal evidence points to otherwise. On the other hand though, I believe 200k is close, but insufficient to place one into the 1%.", "link": "item?id=3467634", "user": "johncch"}], "children": [{"number": 3, "names": "readme", "comments": [{"comment": "The the top 1% is $383K and up.", "link": "item?id=3467641", "user": "mikek"}, {"comment": "The problem is that everything on this website is absolute heresay. We have no way of knowing whether someone is posting truth or lies.", "link": "item?id=3535745", "user": "readme"}, {"comment": "Crunchbase has a section on acquisitions. Never used it personally though.<p><a href=\"http://www.crunchbase.com/acquisitions?page=1\" rel=\"nofollow\">http://www.crunchbase.com/acquisitions?page=1</a>", "link": "item?id=3547124", "user": "patrickk"}], "children": null}, {"number": 1, "names": "jpdoctor", "comments": [{"comment": "&#62; <i>Doesn't anyone keep data startups and acquisitions?</i><p>Pretty much all of the M&#38;A guys have a column in the table which lists $$/head.<p>The number is in the nosebleed sections of valuation lately, as near as I can tell.  I doubt it will end well.", "link": "item?id=3547311", "user": "jpdoctor"}], "children": null}]}, {"number": 2, "names": "philwelch", "comments": [{"comment": "\"You can have invoice collection problems at $50k, too, but they're much less likely than at $500\"<p>Where are you getting that from? From my extensive experience with both large and small transactions I don't find that to be the case. Assuming the profit potential is the same would you rather have the risk of 1 50,000 customer or 100 $500 customers? (Let's assume the $50,000 customer is reselling your product at the same margins).<p>\"If you're not a bank, stop taking on so much credit risk. Businesses can deal with substantially sterner payment terms than you'd think to offer\"<p>It's a risk that needs to be evaluated. Be to easy on credit you loose money. To strict you will loose business. Really no different than security policies or spam filters.<p>It also depends on your margin. If you have a large margin on your product you can afford to take a loss much easier then if you are selling Plasma TV's with very small markup.<p>Currently one of the products we sell is less than $50 and our cost is less than $10. If someone wants to mail a check, no problem. (Although of course we try and get payment by credit card.)  We are making (say) $40 so if we don't get the payment no big deal. Not sure I would say the same if the numbers were 100 times larger though.", "link": "item?id=3536630", "user": "larrys"}, {"comment": "It's somewhat disingenuous anyway, since Amazon, Google, Facebook, and Microsoft were all started within living memory, and Facebook hasn't even really exited yet.", "link": "item?id=3548299", "user": "philwelch"}], "children": null}, {"number": 1, "names": "minikomi", "comments": [{"comment": "What about the reverse - They paid on time, they get a gold star.", "link": "item?id=3536991", "user": "minikomi"}], "children": null}]}